{
    "q36-0": {
        "answer": "b",
        "explanation": "Polymetallic nodules, also known as manganese nodules, are rock concretions on the seafloor that are rich in manganese and iron hydroxides. They contain commercially significant quantities of valuable metals, most notably copper (Cu), nickel (Ni), and cobalt (Co)."
    },
    "q51-0": {
        "answer": "d",
        "explanation": "The Jurassic stratigraphic succession of Kutch in Gujarat, India, is world-renowned for its abundant and diverse fossil fauna, especially ammonites. These extinct marine cephalopods are so well-preserved and common that they are used as index fossils for biostratigraphic zonation of the Jurassic period."
    },
    "q117-0": {
        "answer": "d",
        "explanation": "According to the Gutenberg-Richter law, the frequency of earthquakes is inversely related to their magnitude; therefore, small earthquakes are much more frequent than large ones. Small earthquakes release less energy, which corresponds to a smaller amount of fault slip over a shorter rupture length."
    },
    "q43-0": {
        "answer": "a",
        "explanation": "Venus has an extremely slow retrograde rotation. A sidereal day on Venus (one full rotation on its axis) takes about 243 Earth days, while its orbital period (a year) is only about 225 Earth days. This makes its day longer than its year."
    },
    "q67-0": {
        "answer": "c",
        "explanation": "P-waves (Primary waves) are compressional body waves that travel the fastest through the Earth's interior. Because of their higher velocity, they are the first seismic waves to arrive at a seismograph station after an earthquake."
    },
    "q53-0": {
        "answer": "d",
        "explanation": "The supercontinent Pangaea began to break apart during the Mesozoic Era. The initial rifting started in the Early-Middle Jurassic Period, around 175 million years ago, eventually leading to the formation of the modern continents."
    },
    "q109-0": {
        "answer": "b",
        "explanation": "The first true mammals evolved during the Late Triassic period, and the first birds (evolving from theropod dinosaurs) appeared in the Jurassic period. Both of these periods are part of the Mesozoic Era."
    },
    "q35-0": {
        "answer": "b",
        "explanation": "A point bar is a depositional landform created by the accumulation of alluvium on the inside bend of a river's meander. The water velocity is lower on the inner bank, causing sediment to be deposited."
    },
    "q54-0": {
        "answer": "d",
        "explanation": "The Wardha Valley Coalfield is a major coal-bearing region located in the state of Maharashtra, India. The other localities are known for different resources: Kudremukh for iron ore, Dariba for copper and lead-zinc, and Rudrasagar for oil."
    },
    "q125-0": {
        "answer": "c",
        "explanation": "Hornfelsic texture is a fine-grained, non-foliated texture characteristic of rocks formed by contact metamorphism. This occurs when country rock is heated by an intruding igneous body, causing recrystallization without directed pressure."
    },
    "q108-0": {
        "answer": "d",
        "explanation": "A cirque is an amphitheater-shaped valley head formed by glacial erosion. Processes like plucking and abrasion by a mountain glacier carve out this distinctive landform at the head of the glacial valley."
    },
    "q127-0": {
        "answer": "d",
        "explanation": "The Conrad discontinuity is a seismic boundary recognized within the continental crust, separating the upper, more felsic (sialic) crust from the lower, more mafic (simatic) crust. It is not as universally distinct as the Moho discontinuity."
    },
    "q41-0": {
        "answer": "d",
        "explanation": "The Earth follows an elliptical orbit around the Sun. The point in this orbit where the Earth is closest to the Sun is called perihelion, which occurs each year around January 3rd."
    },
    "q50-0": {
        "answer": "c",
        "explanation": "An aquitard is a geologic layer with low permeability that can store water and transmit it very slowly. It cannot yield water to a well in sufficient quantities but allows for slow leakage between adjacent aquifers."
    },
    "q77-0": {
        "answer": "b",
        "explanation": "The correct pairings are based on famous mining and resource locations in India: (A) Oil - (IV) Gandhar field in Gujarat; (B) Coal - (III) Singareni collieries in Telangana; (C) Copper - (II) Khetri mines in Rajasthan; (D) Uranium - (I) Jadugoda mine in Jharkhand."
    },
    "q96-0": {
        "answer": "a",
        "explanation": "The correct chronological associations are: (A) Cardita beaumoniti beds - Paleocene; (B) Barail Formation - Oligocene; (C) Katrol Formation - Jurassic; (D) Sylhet Formation - Eocene; (E) Ariyalur Formation - Cretaceous; (F) Siwalik rocks - Miocene-Pliocene."
    },
    "q47-0": {
        "answer": "c",
        "explanation": "The transition zone is a region within the Earth's mantle located between the upper mantle and the lower mantle. It is bounded by seismic discontinuities at depths of approximately 410 km and 660 km, where minerals undergo phase transformations due to increasing pressure."
    },
    "q105-0": {
        "answer": "a",
        "explanation": "Mid-Oceanic ridges are constructive (divergent) plate margins where new oceanic crust is formed as tectonic plates pull apart. This extensional process is associated with frequent, but exclusively shallow-focus, earthquakes."
    },
    "q58-0": {
        "answer": "a",
        "explanation": "P-wave velocity depends on the elastic moduli and density of a material. Diamond, being the hardest known natural material, has exceptionally high bulk and shear moduli (stiffness), which results in a very high P-wave velocity, far exceeding that of common rocks like granite or shale."
    },
    "q144-0": {
        "answer": "b",
        "explanation": "The correct chronological order from oldest to youngest is: (Q) Muth Quartzite (Devonian); (P) Talchir Tillite (Early Permian); (S) Umaria Marine Bed (Permian, post-Talchir); (R) Umia Ammonites Bed (Late Jurassic)."
    },
    "q106-0": {
        "answer": "c",
        "explanation": "At the boundary between the solid mantle and the liquid outer core (the Gutenberg discontinuity), there is a sharp drop in P-wave velocity because seismic waves travel more slowly through liquid. Simultaneously, there is a significant increase in material density from the silicate mantle to the iron-nickel core."
    },
    "q93-0": {
        "answer": "d",
        "explanation": "These are key stratigraphic units of Precambrian basins in India: (A) Papaghni Group is in the (IV) Cuddapah Basin; (B) Sullavai Group is in the (III) Pranhita-Godavari Basin; (D) Badami Group is in the (II) Kaladgi Basin; (E) Kheinjua Formation is in the (V) Vindhyan Basin. The (I) Chhatisgarh basin is itself a Neoproterozoic basin."
    },
    "q34-0": {
        "answer": "d",
        "explanation": "The Eparchean unconformity is a major stratigraphic break in the Indian Shield, representing a prolonged period of erosion. It separates the highly deformed and metamorphosed crystalline rocks of the Archaean Eon from the overlying, less deformed sedimentary successions of the Proterozoic Eon."
    },
    "q104-0": {
        "answer": "b",
        "explanation": "Among the planets listed, the terrestrial (rocky) planets are denser than the gas giants. Comparing the terrestrial planets, Venus has a bulk density of 5.24 g/cm³ and Mars has a density of 3.93 g/cm³. The gas giants Jupiter (1.33 g/cm³) and Saturn (0.69 g/cm³) are far less dense. Therefore, Venus has the highest density of the choices."
    },
    "q155-0": {
        "answer": "a",
        "explanation": "The correct chronological sequence of these Himalayan formations from oldest to youngest is: Subathu Formation (Eocene), Dagshahi and Kasauli Formations (Oligocene-Miocene), and Karewa Formation (Plio-Pleistocene). Therefore, the Karewa Formation is the youngest."
    },
    "q73-0": {
        "answer": "b",
        "explanation": "The velocity of an S-wave ($V_s$) is defined by the formula $V_s = sqrt{\frac{mu}{\rho}}$, where $mu$ is the rigidity modulus and $\rho$ is the density. By rearranging the equation to solve for the rigidity modulus ($mu = V_s^2 cdot \rho$), it becomes clear that $mu$ is directly proportional to the square of the S-wave velocity ($V^2$)."
    },
    "q17-0": {
        "answer": "b",
        "explanation": "The chronological sequence from oldest to youngest is: P. Sargur Schist (Archaean) -> Q. Kajrahat Limestone (part of Vindhyan Supergroup, Proterozoic) -> S. Umia Ammonite Bed (Jurassic, Mesozoic) -> R. Cuddalore Sandstone (Mio-Pliocene, Cenozoic)."
    },
    "q32-0": {
        "answer": "b",
        "explanation": "The Ganga-Brahmaputra Delta, also known as the Bengal Delta, is the largest fluvio-deltaic system in the world. It is formed by the confluence of the Ganga, Brahmaputra, and Meghna rivers and covers a vast area in Bangladesh and the Indian state of West Bengal."
    },
    "q72-0": {
        "answer": "d",
        "explanation": "A nonconformity is a type of unconformity where younger sedimentary rocks directly overlie older, eroded igneous or metamorphic rocks, representing a significant gap in the geologic record."
    },
    "q74-0": {
        "answer": "a",
        "explanation": "The Andaman & Nicobar Islands are an island arc system situated on a convergent plate margin. This boundary is marked by the Sunda Trench, an active subduction zone where the Indo-Australian Plate is descending beneath the Burma Plate."
    },
    "q123-0": {
        "answer": "c",
        "explanation": "The correct chronological order of these major Indian volcanic events from oldest to youngest is: (S) Malani volcanism (~750 Ma, Neoproterozoic) -> (R) Panjal volcanism (~250 Ma, Permian) -> (P) Rajmahal volcanism (~118 Ma, Early Cretaceous) -> (Q) Deccan volcanism (~66 Ma, Late Cretaceous)."
    },
    "q48-0": {
        "answer": [
            "a",
            "b",
            "d"
        ],
        "explanation": "This question tests knowledge of intrusive (plutonic) and extrusive (volcanic) rock equivalents. The only correct pair is (c) Granite-Rhyolite. The incorrect pairs are: (a) Gabbro's equivalent is Basalt, not Trachyte; (b) Syenite's equivalent is Trachyte; (d) Granodiorite's equivalent is Dacite, not Basalt."
    },
    "q126-0": {
        "answer": "d",
        "explanation": "A lopolith is a large, concordant, saucer-shaped igneous intrusion that is concave-upward, causing the overlying strata to sag. This is in contrast to a laccolith, which has a flat base and a dome-shaped top."
    },
    "q63-0": {
        "answer": "d",
        "explanation": "The feldspar group of minerals is the most abundant in the Earth's crust. While plagioclase feldspar is the single most common mineral, alkali feldspars like K-feldspar (potassium feldspar) are also extremely common and are the most abundant choice listed, followed by quartz."
    },
    "q49-0": {
        "answer": "b",
        "explanation": "Coesite and Stishovite are high-pressure polymorphs of silica ($SiO_2$). Jasper is a variety of microcrystalline quartz ($SiO_2$). Flinkite, however, is a manganese arsenate hydroxide mineral and is not a variety of silica."
    },
    "q65-0": {
        "answer": "a",
        "explanation": "Diamagnetic materials are weakly repelled by a magnetic field. Calcite ($CaCO_3$) is a classic example of a diamagnetic mineral. The other options contain transition metal elements and are paramagnetic (weakly attracted to a magnetic field)."
    },
    "q166-0": {
        "answer": "8",
        "explanation": "The average distance from the Sun to the Earth is approximately 150 million kilometers. Light travels at about 300,000 kilometers per second. Dividing the distance by the speed gives about 500 seconds, which is equivalent to approximately 8 minutes and 20 seconds."
    },
    "q176-0": {
        "answer": "d",
        "explanation": "Lignite, often called brown coal, is the lowest rank of coal. It is characterized by its high moisture content, low carbon content, and often retains the original texture of the wood from which it was formed."
    },
    "q174-0": {
        "answer": "d",
        "explanation": "Comparing the approximate durations: Cretaceous Period (~79 million years), Jurassic Period (~56 million years), Ordovician Period (~42 million years), and Silurian Period (~24 million years). The Cretaceous Period had the longest duration among the options."
    },
    "q238-0": {
        "answer": "d",
        "explanation": "Felsic rocks are rich in feldspar and quartz, while mafic rocks are rich in minerals like olivine and pyroxene. Rock X is ultramafic (most mafic). Rock Y consists of 100% felsic minerals. Rock Z is also felsic but contains 20% mafic biotite. Therefore, Rock Y is more felsic than both X and Z."
    },
    "q242-0": {
        "answer": "0.273",
        "explanation": "The normal incidence P-wave reflection coefficient (R) is calculated as $R = (Z_2 - Z_1) / (Z_2 + Z_1)$, where Z is acoustic impedance ($\rho V$). Here, $Z_1 = 2000 \times 1800 = 3.6 \times 10^6$ and $Z_2 = 3000 \times 2100 = 6.3 \times 10^6$. Thus, $R = (6.3 - 3.6) / (6.3 + 3.6) \times 10^6 = 2.7 / 9.9 approx 0.273$."
    },
    "q177-0": {
        "answer": "b",
        "explanation": "The Earth's magnetic field is generated by the geodynamo mechanism. This process involves vigorous convection currents of the molten, electrically conductive iron-nickel alloy within the planet's liquid outer core."
    },
    "q186-0": {
        "answer": "b",
        "explanation": "A regular tetrahedron, a crystal form belonging to the isometric system, possesses a total of six planes of symmetry. Each mirror plane passes through one edge of the tetrahedron and bisects the opposite edge."
    },
    "q241-0": {
        "answer": "1525.42",
        "explanation": "Dry density ($\rho_d$) is calculated from bulk density ($\rho_b$) and water content (w, as a decimal) using the formula $\rho_d = \rho_b / (1 + w)$. Given $\rho_b = 1800$ kg/m³ and $w = 18% = 0.18$, the dry density is $1800 / (1 + 0.18) = 1800 / 1.18 approx 1525.42$ kg/m³."
    },
    "q190-0": {
        "answer": [
            "a",
            "b",
            "d"
        ],
        "explanation": "Folds are bends in rock layers. A syncline is a downward-closing fold, while an antiform and a synform are general terms for upward- and downward-closing folds, respectively. A horst is a raised block bounded by normal faults and is a fault structure, not a fold."
    },
    "q197-0": {
        "answer": "d",
        "explanation": "In terms of relative abundance in the Earth's stratigraphic record, shales and mudstones are the most common (~65%), followed by sandstones (~20-25%), and then limestones (~10-15%). Conglomerates are the least abundant type of sedimentary rock."
    },
    "q188-0": {
        "answer": [
            "c"
        ],
        "explanation": "The ratio of oxygen to silicon atoms (O:Si) is determined by the silicate structure. An O:Si ratio of 4:1 corresponds to nesosilicates, where the silica tetrahedra ($SiO_4$) are isolated. Olivine ($(Mg,Fe)_2SiO_4$) is a nesosilicate and has this ratio."
    },
    "q196-0": {
        "answer": "c",
        "explanation": "The correct matches are: (A) Millipede texture - (II) Inclusion trails curve from the porphyroblast into the matrix foliation. (B) Decussate texture - (IV) Randomly oriented mineral grains. (C) Spherulite - (III) Radiating fibrous aggregate. (D) Core-mantle structure - (I) Large strained grains surrounded by fine recrystallized grains."
    },
    "q239-0": {
        "answer": [
            "a",
            "d"
        ],
        "explanation": "The electromagnetic spectrum in order of increasing wavelength is: Gamma ray < X-ray < UV < Visible < Near-IR < Thermal IR < Microwave < Radio wave. Based on this order, the sequences in options (a) and (d) are correct."
    },
    "q243-0": {
        "answer": "6.45",
        "explanation": "Using Archie's Law, $R_o = (a/phi^m) cdot R_w$, where $R_o=60$, $R_w=0.25$, $a=1$, and $m=2$. The equation becomes $60 = (1/phi^2) cdot 0.25$. Solving for porosity ($phi$): $phi^2 = 0.25 / 60$, so $phi = sqrt{0.25/60} approx 0.0645$. In percentage, this is 6.45%."
    },
    "q210-0": {
        "answer": "40",
        "explanation": "Drainage Density (Dd) is total stream length (L) divided by basin area (A). For basin A, $Dd_A = 20 \text{ km} / 25 \text{ km}^2 = 0.8 \text{ km/km}^2$. Since the densities are equal, $Dd_B = 0.8$. For basin B, $L_B = Dd_B \times A_B = 0.8 \times 50 \text{ km}^2 = 40 \text{ km}$."
    },
    "q203-0": {
        "answer": [
            "a",
            "b"
        ],
        "explanation": "Fractional crystallization is a process of magmatic differentiation that can concentrate certain minerals. Layered intrusions with peridotite hosting chromite (Cr) and anorthosite hosting titanium-iron (Ti-Fe) oxides are classic examples of deposits formed by this process."
    },
    "q235-0": {
        "answer": "b",
        "explanation": "The seismic discontinuity at approximately 410 km depth, which marks the top of the mantle's transition zone, is caused by a pressure-induced phase change where olivine transforms into the denser spinel mineral structure (wadsleyite)."
    },
    "q237-0": {
        "answer": "c",
        "explanation": "The Bouguer anomaly is what remains after gravity measurements are corrected for latitude, elevation, and the gravitational effect of the terrain. Therefore, any remaining variations in the Bouguer anomaly are caused by lateral changes in rock density in the subsurface."
    },
    "q233-0": {
        "answer": "c",
        "explanation": "During metamorphism, increasing temperature drives recrystallization and grain growth to minimize the total surface energy. As individual mineral grains grow larger, their volume ($V propto r^3$) increases faster than their surface area ($A propto r^2$), thus increasing the volume-to-surface area ratio."
    },
    "q183-0": {
        "answer": "40",
        "explanation": "Young's Modulus (E) is the ratio of stress ($sigma$) to strain ($epsilon$). Given the uniaxial compressive strength (stress) is 200 MPa and the corresponding strain is 0.005, the calculation is $E = 200 \text{ MPa} / 0.005 = 40,000 \text{ MPa}$. Converting to Gigapascals (1 GPa = 1000 MPa), the answer is 40 GPa."
    },
    "q191-0": {
        "answer": "86.4",
        "explanation": "Transmissivity (T) is the product of Hydraulic Conductivity (K) and aquifer thickness (b). First, convert K to m/day: $K = 10^{-2} \text{ cm/s} = 10^{-4} \text{ m/s}$. Since there are 86,400 seconds in a day, $K = 10^{-4} \times 86400 = 8.64 \text{ m/day}$. Then, $T = K \times b = 8.64 \text{ m/day} \times 10 \text{ m} = 86.4 \text{ m}^2/\text{day}$."
    },
    "q187-0": {
        "answer": [
            "b",
            "d"
        ],
        "explanation": "The Quaternary is the most recent Period of the Cenozoic Era. It is formally divided into two epochs: the Pleistocene Epoch (from 2.58 million years ago to 11,700 years ago) and the Holocene Epoch (from 11,700 years ago to the present)."
    },
    "q236-0": {
        "answer": "c",
        "explanation": "Venus is often called Earth's 'sister planet' because of their similar size. The equatorial radius of Venus is approximately 6,052 km, which is very close to Earth's equatorial radius of approximately 6,378 km."
    },
    "q232-0": {
        "answer": "c",
        "explanation": "Chronostratigraphic units are bodies of rock that correspond to specific intervals of geologic time. 'Stage' is a fundamental chronostratigraphic unit. 'Period' is its equivalent geochronologic (time) unit. 'Member' is a lithostratigraphic unit, and 'Acme Zone' is a biostratigraphic unit."
    },
    "q230-0": {
        "answer": "1866",
        "explanation": "The age (t) is calculated from the isochron slope (m) using the decay equation $m = e^{lambda t} - 1$. For small slopes, this can be approximated as $t approx m / lambda$. Using the given values: $t = 0.0265 / (1.42 \times 10^{-11} \text{ year}^{-1}) approx 1.866 \times 10^9$ years, which is 1866 million years."
    },
    "q234-0": {
        "answer": "b",
        "explanation": "Dynamic viscosity ($mu$) is defined by the relationship between shear stress ($\tau$) and shear rate. The dimension of stress is $ML^{-1}T^{-2}$ and the dimension of shear rate is $T^{-1}$. Therefore, the dimension of dynamic viscosity is Stress / Shear Rate = $(ML^{-1}T^{-2}) / T^{-1} = ML^{-1}T^{-1}$."
    },
    "q289-0": {
        "answer": "1.01",
        "explanation": "First, calculate the moles of each oxide per 100g of sample. Molar Mass of CaO ≈ 56.08 g/mol; Molar Mass of MgO ≈ 40.31 g/mol. Moles CaO = 7g / 56.08 g/mol ≈ 0.1248 mol. Moles MgO = 5g / 40.31 g/mol ≈ 0.1240 mol. The molar ratio of CaO to MgO is 0.1248 / 0.1240 ≈ 1.006, which rounds to 1.01."
    },
    "q285-0": {
        "answer": "b",
        "explanation": "Seismic methods, particularly those using waves from natural earthquakes (seismic tomography), can travel through the entire planet. They provide the most detailed and highest-resolution information about deep Earth structures like the mantle and core, on the order of thousands of kilometers."
    },
    "q283-0": {
        "answer": "a",
        "explanation": "Io, one of Jupiter's Galilean moons, is the most volcanically active body in the Solar System. Its intense volcanic activity, with hundreds of active volcanoes, is driven by powerful tidal heating generated by Jupiter's immense gravity."
    },
    "q294-0": {
        "answer": [
            "a",
            "d"
        ],
        "explanation": "Significant iron mineralization typically involves dense and magnetic minerals like magnetite. This would cause a positive Bouguer gravity anomaly due to the excess mass and a positive magnetic anomaly due to the high magnetic susceptibility of the ore."
    },
    "q287-0": {
        "answer": [
            "a",
            "c"
        ],
        "explanation": "Two of the 'Big Five' mass extinctions in Earth's history occurred at these boundaries. The Permian-Triassic (P-T) extinction event was the most severe extinction event ever. The Cretaceous-Paleogene (K-Pg) event is famous for the extinction of the non-avian dinosaurs."
    },
    "q288-0": {
        "answer": "1.10",
        "explanation": "Drainage density is the total length of all streams divided by the watershed area. Total stream length = (3+2.5+4+3+2+5) + (10+15+7) + 30 = 81.5 km. Area = 74 km². Drainage Density = 81.5 km / 74 km² ≈ 1.10 km/km²."
    },
    "q290-0": {
        "answer": "b",
        "explanation": "Oxide minerals are those where oxygen is bonded to one or more metals. Spinel ($MgAl_2O_4$), Corundum ($Al_2O_3$), and Rutile ($TiO_2$) are all oxide minerals. The other options contain minerals from different classes such as halides, carbonates, silicates, and sulfides."
    },
    "q1070-hz3": {
        "answer": "b",
        "explanation": "Primary porosity is the pore space that exists at the time of sediment deposition. Intraparticle porosity, the space within individual grains like fossil fragments, is a type of primary porosity. Vuggy, moldic, and most intercrystalline porosities are secondary, formed after deposition."
    },
    "q187-hz3": {
        "answer": "c",
        "explanation": "Chondrites are undifferentiated stony meteorites containing chondrules, which are droplets of silicate minerals that cooled in the early solar nebula. They are considered primitive because they have not been altered by melting or differentiation and represent the building blocks of the terrestrial planets."
    },
    "q525-hz3": {
        "answer": "c",
        "explanation": "The Philippines is a volcanic island arc formed at a convergent plate boundary where the oceanic Philippine Sea Plate subducts beneath the Eurasian Plate. Iceland is on a divergent boundary, and the west coast of California is primarily a transform boundary."
    },
    "q484-hz3": {
        "answer": "a",
        "explanation": "Kyanite is an aluminosilicate mineral that characteristically forms long, columnar crystals that are flattened in one direction. This common crystal habit is described as 'bladed'."
    },
    "q620-hz3": {
        "answer": "b",
        "explanation": "In the early solar nebula, the region close to the Sun was very hot. The intense heat and solar wind vaporized volatile materials like hydrogen, helium, and water ice, driving them away to the colder outer regions where they could condense to form the gas and ice giants. Denser, rocky materials remained in the inner solar system."
    },
    "q313-hz3": {
        "answer": "b",
        "explanation": "Chemical weathering involves chemical reactions that are accelerated by heat and the presence of water. Therefore, chemical weathering processes are most rapid and intense in hot and humid (e.g., tropical) climatic conditions."
    },
    "q327-hz3": {
        "answer": "a",
        "explanation": "Earthquake magnitude is a measure of the total energy released at the source and is a single value for the event. Earthquake intensity measures the level of shaking and damage at a specific location, which decreases as seismic waves lose energy while traveling away from the epicenter."
    },
    "q2-hz3": {
        "answer": "a",
        "explanation": "The chemical reaction shows magnesium ions ($Mg^{2+}$) replacing calcium ions in calcium carbonate ($CaCO_3$) to form the mineral dolomite ($CaMg(CO_3)_2$). This geological process of converting limestone into dolostone is called dolomitization."
    },
    "q464-hz3": {
        "answer": "d",
        "explanation": "Pyrolite is a theoretical rock composition, hypothesized to be a mixture of approximately 3 parts peridotite and 1 part basalt. It is considered to be a model for the chemical composition of the Earth's primitive upper mantle."
    },
    "q1105-hz3": {
        "answer": "d",
        "explanation": "Faster subduction is often linked to older, colder, and denser oceanic slabs. These slabs tend to sink at a steeper angle and experience 'slab rollback', which can pull the overriding plate towards the trench, leading to extension and the formation of a deeper, narrower trench."
    },
    "q605-hz3": {
        "answer": "c",
        "explanation": "The Sun appears directly overhead at noon (at the zenith) at the Tropic of Cancer (23.5° N latitude) on the June solstice (around June 21st). This event marks the beginning of summer in the Northern Hemisphere."
    },
    "q616-hz3": {
        "answer": "c",
        "explanation": "Estuaries are environments where freshwater from rivers mixes with saltwater from the sea, leading to significant fluctuations in salinity. Organisms that are adapted to tolerate a wide range of salinity are termed 'euryhaline' and are characteristic of such environments."
    },
    "q591-hz3": {
        "answer": "d",
        "explanation": "Deep-focus earthquakes (depth > 300 km) occur within cold, brittle slabs of subducting oceanic lithosphere. These inclined zones of seismicity (Wadati-Benioff zones) are hallmarks of subduction zones, which are typically associated with island arcs and active continental margins."
    },
    "q592-hz3": {
        "answer": "b",
        "explanation": "Assertion (A) is true; seismic waves travel faster in more rigid materials (solids) than in fluids. Reason (R) is false; P-wave velocity increases when a sandstone is saturated with water because the water greatly increases the rock's incompressibility (bulk modulus), which outweighs the small increase in density."
    },
    "q239-hz3": {
        "answer": "d",
        "explanation": "The Andes Mountains are formed by a destructive (convergent) plate boundary. The Atlantic Ocean is widening due to a constructive (divergent) boundary at the Mid-Atlantic Ridge. The San Andreas Fault is a conservative (transform) plate boundary."
    },
    "q502-hz3": {
        "answer": "a",
        "explanation": "The term 'isostasy' was coined by the American geologist Clarence Dutton in 1889. He used it to describe the theoretical state of gravitational equilibrium between Earth's lithosphere and asthenosphere, where tectonic plates 'float' at an elevation dependent on their thickness and density."
    },
    "q1926-hz3": {
        "answer": "d",
        "explanation": "The equations represent key biogeochemical processes: (A) Photosynthesis converts inorganic carbon to organic matter. (B) Denitrification is a form of anaerobic respiration converting nitrate to nitrogen gas. (C) Carbonate precipitation forms solid limestone. (D) Silicate weathering consumes atmospheric CO2."
    },
    "q462-hz3": {
        "answer": "d",
        "explanation": "Beryl is a mineral that typically crystallizes in the hexagonal system and commonly forms prismatic crystals that are elongated along the vertical c-axis. This is a characteristic elongated structure."
    },
    "q559-hz3": {
        "answer": "d",
        "explanation": "The density of the rock is a weighted average of its components. Using the densities of quartz (~2.65 g/cc) and magnetite (~5.15 g/cc), the calculation is: (60% × 2.65 g/cc) + (40% × 5.15 g/cc) = 1.59 + 2.06 = 3.65 g/cc. The closest answer is 3.6 g/cc."
    },
    "q494-hz3": {
        "answer": "d",
        "explanation": "According to Bowen's reaction series, minerals that crystallize at lower temperatures also melt at lower temperatures. Rhyolite is a felsic rock composed of minerals like quartz and feldspar, which are at the low-temperature end of the series. Therefore, rhyolite has the lowest melting temperature range compared to more mafic rocks."
    },
    "q1893-hz3": {
        "answer": "a",
        "explanation": "These are feature-process matches: (A) Varve - annual sediment layers in glacial lakes (Fluvioglacial). (B) Demoiselle (earth pillar) - erosional remnant in arid/badland areas (Arid process). (C) Pingo - ice-cored hill (Periglacial process). (D) Ridge and swell - floodplain or beach feature (Fluvial process)."
    },
    "q1983-hz3": {
        "answer": "a",
        "explanation": "Platinum Group Elements (PGEs) have a strong affinity for mafic and ultramafic magmas. They become concentrated during magmatic processes and are most commonly hosted in large, layered ultramafic igneous intrusions like dunites, peridotites, and pyroxenites."
    },
    "q566-hz3": {
        "answer": "d",
        "explanation": "Caves and karst landscapes primarily form in soluble rocks like limestone. The key chemical weathering process is carbonation, where carbonic acid (formed from atmospheric CO2 dissolving in water) reacts with and dissolves the calcium carbonate in the limestone."
    },
    "q1060-hz3": {
        "answer": "a",
        "explanation": "Jupiter, the largest planet in our solar system, also has the fastest rotation. It completes one full rotation on its axis in just under 10 hours (approximately 9 hours and 56 minutes), giving it the shortest day."
    },
    "q461-hz3": {
        "answer": "c",
        "explanation": "The term 'foliated' is derived from the Latin word 'folium' for leaf. It is used in geology to describe the parallel, planar alignment of minerals (like mica) in a metamorphic rock, giving it a layered or sheet-like appearance."
    },
    "q480-hz3": {
        "answer": "a",
        "explanation": "A refractory material is a substance that is resistant to heat. Silica ($SiO_2$), in the form of quartz sand or quartzite, has a very high melting point (around 1700°C) and is widely used to manufacture refractory bricks for lining industrial furnaces."
    },
    "q1973-hz3": {
        "answer": "d",
        "explanation": "Ecosystem services are the benefits humans receive from ecosystems. Decomposition, pollination, and soil formation are all processes that provide direct services. 'Sustaining biodiversity' is an inherent property or attribute of a healthy ecosystem that underpins its ability to provide services, rather than being a service itself."
    },
    "q240-hz3": {
        "answer": "a",
        "explanation": "Water ($H_2O$) is the most crucial agent of chemical weathering. It acts as a solvent, is a key reactant in hydrolysis and hydration, and combines with other atmospheric gases like $CO_2$ to form acids that dissolve rock minerals."
    },
    "q186-hz3": {
        "answer": "a",
        "explanation": "By mass, the most abundant elements in the solar system (and the universe) are Hydrogen (~74%) and Helium (~24%). The third most abundant element is Oxygen, making up about 1% of the total mass."
    },
    "q1085-hz3": {
        "answer": "b",
        "explanation": "The solum (from Latin for 'soil') is the upper part of the soil profile, comprising the A, E, and B horizons. It is the zone where active soil-forming (pedogenic) processes occur and where most plant roots are found."
    },
    "q481-hz3": {
        "answer": "a",
        "explanation": "While sedimentary rocks cover about 75% of the Earth's surface, they form a relatively thin layer. By volume, the Earth's crust is dominated by igneous and metamorphic rocks, with igneous rocks (like granite and basalt) being the most abundant overall."
    },
    "q514-hz3": {
        "answer": "b",
        "explanation": "Based on the age of its oldest stars and globular clusters, the age of the Milky Way galaxy is estimated to be approximately 13.6 billion years old, nearly as old as the Universe itself. The closest answer is 13.51 billion years. (The age of the Solar System is ~4.6 billion years)."
    },
    "q552-hz3": {
        "answer": "a",
        "explanation": "Magnetite ($Fe_3O_4$) is strongly magnetic (ferrimagnetic), while Hematite ($Fe_2O_3$) is only weakly magnetic. By weight percentage, magnetite contains approximately 72.4% iron, which is slightly higher than hematite's ~69.9%. Thus, magnetite is more magnetic and has a higher iron content."
    },
    "q1066-hz3": {
        "answer": "c",
        "explanation": "Chalcopyrite ($CuFeS_2$) is the most important copper ore. It is characterized by its metallic luster, brassy-yellow color, and a distinctive greenish-black streak, which helps distinguish it from similar-looking minerals like pyrite."
    },
    "q261-hz3": {
        "answer": "d",
        "explanation": "Critical refraction occurs at a specific angle of incidence determined by the velocity contrast across a boundary (Snell's Law). Since P and S waves have different velocities, their critical angles will be different. The faster P-wave will reach its critical angle at a smaller epicentral distance (closer to the epicenter) than the slower S-wave."
    },
    "q471-hz3": {
        "answer": [
            "b",
            "d"
        ],
        "explanation": "The strength of chemical bonds, such as in an ionic crystal, is generally inversely proportional to the size of the ions (or the distance between them) and directly proportional to the magnitude of their charges. Statements claiming that bond strength is directly proportional to ion size are incorrect."
    },
    "q606-hz3": {
        "answer": "b",
        "explanation": "Serpentine minerals are formed through a process called serpentinization, which is the hydrothermal alteration of mafic and ultramafic rocks. The primary precursor minerals that alter to serpentine are olivine and pyroxene."
    },
    "q114-hz3": {
        "answer": "a",
        "explanation": "The epicenter of an earthquake is, by definition, the point on the Earth's surface directly above the hypocenter (or focus), which is the point of origin of the earthquake. Regardless of the focus depth (shallow, intermediate, or deep), the epicenter is always a location on the surface."
    },
    "q503-hz3": {
        "answer": "d",
        "explanation": "Bauxite is the primary ore of aluminum. It is not a single mineral but a rock composed mainly of aluminum hydroxide minerals, the most important of which are gibbsite ($Al(OH)_3$), boehmite, and diaspore."
    },
    "q1910-hz3": {
        "answer": "b",
        "explanation": "The effective temperature ($T_e$) of a planet is found by equating absorbed solar energy with emitted thermal energy. The correct relationship is given by the Stefan-Boltzmann law as $T_e = left[ \frac{S(1-alpha)}{4 epsilon sigma} \right]^{1/4}$. The notation in option (b) is unconventional but is the only one that includes the correct components in the correct relationship, likely with typos."
    },
    "q238-hz3": {
        "answer": "c",
        "explanation": "The correct order of abundance (by weight) for the most common elements in the Earth's crust is: Oxygen > Silicon > Aluminum > Iron > Calcium > Magnesium. Option (c) presents the most accurate sequence among the choices provided."
    },
    "q139-hz3": {
        "answer": "c",
        "explanation": "Diamonds are formed deep in the mantle and brought to the surface by specific types of volcanic eruptions. Besides kimberlites, which are the most common host, lamproites are the only other significant primary igneous rock known to contain economic diamond deposits."
    },
    "q489-hz3": {
        "answer": "b",
        "explanation": "A glassy (or hyaline) texture forms when molten rock cools so rapidly that there is no time for crystals to grow. Obsidian is a natural volcanic glass and the quintessential example of an igneous rock with a glassy texture."
    },
    "q488-hz3": {
        "answer": "b",
        "explanation": "The mineral olivine is well known for its typical olive green color. However, its streak (the color of its powder when scraped on a porcelain plate) is colorless or white, which is common for silicate minerals."
    },
    "q509-hz3": {
        "answer": "c",
        "explanation": "Tectonic processes are the fundamental drivers of the Earth's large-scale geography. They control the position of continents, the formation of mountain ranges, and the configuration of ocean basins. These factors, in turn, are the primary controls on global climate patterns and the creation of geographic barriers that shape the evolution and distribution of life."
    },
    "q121-hz3": {
        "answer": "a",
        "explanation": "Seismic waves are classified into two main types: body waves (P-waves and S-waves), which travel through the Earth's interior, and surface waves (Love waves and Rayleigh waves), which are confined to the surface. The statement that Love waves are body waves is incorrect."
    },
    "q470-hz3": {
        "answer": "d",
        "explanation": "Matching the substances with their approximate specific heat capacities (in cal/g): (A) Pure Water - 1.000 (IV); (B) Sandstone - ~0.26 (III); (C) Iron - 0.106 (V); (D) Silver - 0.056 (II); (E) Copper - ~0.09, closest is 0.082 (I). This gives the sequence (IV), (III), (V), (II), (I)."
    },
    "q1016-hz3": {
        "answer": "a",
        "explanation": "A sediment transport-limited system occurs when the amount of sediment supplied to a system (e.g., a river) exceeds the system's capacity to transport it. This directly leads to the deposition and storage of the excess sediment. Therefore, the reason correctly explains the assertion."
    },
    "q291-hz3": {
        "answer": "d",
        "explanation": "Diatomite is a siliceous sedimentary rock formed from the fossilized remains of diatoms. The skeletons of diatoms are made of silica ($SiO_2$), so high-purity diatomite is typically composed of 80-90% silica, with minor impurities like clays (alumina) and iron oxides."
    },
    "q508-hz3": {
        "answer": "a",
        "explanation": "Bauxite is a rock, not a single mineral, and thus does not have a crystal form. However, it commonly occurs in a pisolitic structure, which is an aggregate of small, spherical concretions (pisoliths) cemented together."
    },
    "q219-hz3": {
        "answer": "a",
        "explanation": "The correct matches are: (1) Divergent boundary - (iii) Seafloor spreading/rifting - (Q) East African rift valley; (2) Convergent boundary - (i) Subduction/collision - (R) Himalaya; (3) Transform boundary - (ii) Faulting - (P) San Andreas Fault."
    },
    "q396-hz3": {
        "answer": "c",
        "explanation": "During the cold weather season in northern India, the days are typically clear and sunny, which leads to pleasant, warm temperatures. However, the clear skies allow for significant radiational cooling at night, resulting in cold nights and a large diurnal temperature range."
    },
    "q479-hz3": {
        "answer": "d",
        "explanation": "Ultrabasic (or ultramafic) rocks are igneous rocks with very low silica content. Komatiite, kimberlite, and peridotite are all examples of ultrabasic rocks. Dolomite, however, is a carbonate mineral ($CaMg(CO_3)_2$) that forms a sedimentary rock (dolostone)."
    },
    "q1980-hz3": {
        "answer": "c",
        "explanation": "In the process of chemical weathering of silicate minerals, a general sequence of clay mineral formation indicates increasing weathering intensity: illite -> vermiculite -> kaolinite. Kaolinite represents an advanced stage of weathering where most mobile cations have been leached away, leaving a stable aluminum silicate."
    },
    "q646-hz3": {
        "answer": "a",
        "explanation": "The approximate average surface temperatures are: Neptune (-201°C), Earth (15°C), Mercury (167°C), Venus (464°C). Venus is the hottest planet due to a runaway greenhouse effect, despite being farther from the Sun than Mercury. The sequence in option (a) is correct."
    },
    "q486-hz3": {
        "answer": "b",
        "explanation": "Pumice is a type of extrusive volcanic rock that is highly vesicular (filled with gas bubbles). Its porous structure gives it a very low bulk density, often low enough for it to float on water. Other igneous rocks like gabbro, granite, and basalt are much denser."
    },
    "q602-hz3": {
        "answer": "b",
        "explanation": "The Earth is shielded from the majority of incoming solar wind and cosmic rays by its global magnetic field, the magnetosphere. The Moon lacks such a protective magnetic field, allowing these high-energy particles to directly impact its entire surface."
    },
    "q1952-hz3": {
        "answer": "c",
        "explanation": "The Sun is immensely massive compared to the rest of the objects in the Solar System. It contains approximately 99.86% of the total mass of the entire system. All the planets, moons, asteroids, and comets combined make up the remaining fraction."
    },
    "q483-hz3": {
        "answer": "d",
        "explanation": "The correct sequence of minerals in order of increasing specific gravity (density) is: Halite (~2.2), Orthoclase (~2.6), Quartz (~2.65), Anorthite (~2.75), Hypersthene (~3.5), and Nickel (~8.9). Option (d) follows this order."
    },
    "q1068-hz3": {
        "answer": "a",
        "explanation": "Cryptocrystalline quartz varieties consist of crystals that are too small to be seen with the naked eye. Chalcedony, agate, and jasper are examples. Amethyst is a macrocrystalline variety of quartz, characterized by its visible, purple-colored crystals."
    },
    "q607-hz3": {
        "answer": "a",
        "explanation": "Paramagnetic materials are weakly attracted to an external magnetic field, meaning they have a small, positive magnetic susceptibility. According to Curie's Law, this susceptibility is inversely proportional to temperature, so it decreases as the material gets hotter."
    },
    "q161-hz3": {
        "answer": "c",
        "explanation": "The chemical weathering of silicate minerals is a major geological process that consumes atmospheric carbon dioxide. The reaction involves $CO_2$ dissolved in water (carbonic acid) breaking down the minerals. Therefore, a higher rate of silicate weathering leads to a drawdown and decrease of $CO_2$ in the atmosphere over long timescales."
    },
    "q125-hz3": {
        "answer": "b",
        "explanation": "In soil science, eluviation (I) is the process of washing materials out of the upper soil horizons (A and E). Illuviation (II) is the subsequent process of accumulating those materials (like clay and iron oxides) in a lower horizon (B)."
    },
    "q760-hz3": {
        "answer": "c",
        "explanation": "The force of gravity is weakest at the Earth's equator. This is due to the combined effect of the planet's equatorial bulge (locations on the equator are farther from the center of mass) and the centrifugal force from rotation, which is maximal at the equator and opposes gravity. Of the cities listed, Colombo, Sri Lanka, is closest to the equator."
    },
    "q244-hz3": {
        "answer": "a",
        "explanation": "A deep oceanic trench is the prominent topographic feature on the seafloor that marks the line where one tectonic plate begins to descend (subduct) beneath another. It is the surface expression of the subduction zone."
    },
    "q504-hz3": {
        "answer": "c",
        "explanation": "Beryl is a mineral group that includes several well-known gemstones. The most famous and valuable variety of beryl is the green gemstone known commercially as emerald. Other varieties include aquamarine (blue) and morganite (pink)."
    },
    "q496-hz3": {
        "answer": "a",
        "explanation": "Muscovite is a hydrous mineral (it contains OH groups in its structure). It is stable only up to a certain temperature, beyond which it breaks down via dehydration reactions. This breakdown occurs at a much lower temperature than the melting points of the anhydrous minerals quartz, olivine, and periclase."
    },
    "q1009-hz3": {
        "answer": "b",
        "explanation": "The Gutenberg-Richter law states $log_{10} N = a - bM$. For M=1, N=10000, so $4 = a - b$. For M=2, N=100, so $2 = a - 2b$. Subtracting the second equation from the first gives $(4-2) = (a-b) - (a-2b)$, which simplifies to $2 = b$. Therefore, the b-value is 2.0."
    },
    "q359-hz3": {
        "answer": "d",
        "explanation": "Perihelion is the point in Earth's orbit when it is closest to the Sun. This event occurs annually in early January, between the 2nd and 5th of the month. In the year 2019, perihelion occurred on January 3rd."
    },
    "q518-hz3": {
        "answer": [
            "a",
            "b",
            "c"
        ],
        "explanation": "The Appalachian Mountains are an ancient range formed by continental-continental collision. The Japanese Islands are a volcanic arc from oceanic subduction. The Andes are a volcanic range from continent-ocean collision. The Andaman and Nicobar Islands are also formed by subduction, not sea-floor spreading."
    },
    "q302-hz3": {
        "answer": "b",
        "explanation": "Headward erosion is the process by which a river lengthens its channel in an upstream direction. While it increases the length of the valley and can lead to stream capture, it is part of the overall erosional process that works to decrease, not increase, the channel's gradient over time."
    },
    "q1984-hz3": {
        "answer": "a",
        "explanation": "Mid-oceanic ridges are divergent plate boundaries where hot magma from the mantle rises to the surface to create new oceanic crust. This process of upwelling magma and volcanism results in the highest surface heat flow values found on Earth. Cratons, in contrast, are old and cold with very low heat flow."
    },
    "q157-hz3": {
        "answer": "b",
        "explanation": "Smectite clays (like montmorillonite) are 2:1 clays that can swell. Their formation is favored in environments with poor drainage and relatively low rainfall or distinct dry seasons. These conditions prevent complete leaching and allow for the accumulation of cations like Ca and Mg, which are essential for smectite's structure."
    },
    "q528-hz3": {
        "answer": "c",
        "explanation": "A white dwarf is the dense remnant core of a low- or medium-mass star that has exhausted its nuclear fuel. It is supported against further gravitational collapse by electron degeneracy pressure, a quantum mechanical effect, and is therefore composed of electron-degenerate matter."
    },
    "q478-hz3": {
        "answer": "b",
        "explanation": "Mineral cleavage is rated by its quality. 'Distinct' or 'Good' cleavage describes surfaces that are flat and easily produced but may be interrupted by fractures or other imperfections. 'Perfect' cleavage (like in mica) implies smooth, continuous planes."
    },
    "q495-hz3": {
        "answer": "d",
        "explanation": "The crystal habit term 'tabular' is used to describe minerals that grow in a flattened, tablet-like or plate-like shape. These crystals are elongated in two dimensions but short in the third."
    },
    "q515-hz3": {
        "answer": "a",
        "explanation": "The resistance of silicate minerals to chemical weathering follows Goldich's dissolution series, which is the reverse of Bowen's reaction series. Minerals formed at high temperatures (like olivine) are least stable at the surface, while those formed at low temperatures (like quartz) are the most resistant to weathering."
    },
    "q318-hz3": {
        "answer": "c",
        "explanation": "The Japanese islands are a classic example of a volcanic island arc formed by the subduction of the oceanic Pacific plate beneath the oceanic Eurasian plate. The other pairs are incorrectly matched with their tectonic settings."
    },
    "q259-hz3": {
        "answer": "b",
        "explanation": "Intraplate earthquakes occur within a tectonic plate, away from its boundaries. These earthquakes are confined to the cold, brittle portion of the lithosphere and are therefore almost always shallow-focus, predominantly occurring at depths of less than 40 km."
    },
    "q4-hz3": {
        "answer": "a",
        "explanation": "Syn-sedimentary deformational structures (like slumps and convoluted bedding) form while sediments are still soft and unconsolidated. A high rate of sedimentation can create unstable slopes and increase pore pressure, leading to gravitational failure and deformation of the freshly deposited layers."
    },
    "q564-hz3": {
        "answer": "c",
        "explanation": "Clay soils are composed of very fine particles that create a vast network of tiny pore spaces (micropores). These micropores have a large surface area and hold water effectively through capillary forces, giving clay a high water-holding capacity. In contrast, sandy soils have large pores and drain quickly."
    },
    "q1098-hz3": {
        "answer": "d",
        "explanation": "A halo is an optical phenomenon created when sunlight or moonlight is refracted by millions of hexagonal ice crystals suspended in the atmosphere, typically in high-altitude cirrus or cirrostratus clouds. The most common is the 22° halo."
    },
    "q609-hz3": {
        "answer": "a",
        "explanation": "Yardangs are streamlined erosional ridges carved from bedrock by the abrasive action of wind. Their formation requires a strong, dominant, and unidirectional wind to create their characteristic elongated shape. Strong multi-directional winds would lead to more complex and less defined erosional forms."
    },
    "q197-hz3": {
        "answer": "b",
        "explanation": "Rayleigh waves are surface waves that can propagate along the free surface of a single, uniform (homogeneous) medium. Love waves, however, are guided waves that require a low-velocity layer overlying a higher-velocity substrate to exist. In a perfectly homogeneous medium, this condition is not met, so only Rayleigh waves can form."
    },
    "q493-hz3": {
        "answer": [
            "c",
            "d"
        ],
        "explanation": "Dynamothermal metamorphism (or regional metamorphism) involves changes in both temperature and directed pressure (stress). This process produces characteristic foliated metamorphic rocks. Schist and gneiss are classic examples of rocks formed under medium-to-high grade regional metamorphism."
    },
    "q449-hz3": {
        "answer": "c",
        "explanation": "First, find the mass of dry soil (120g - 25g = 95g) and the mass of water (140g - 120g = 20g). The soil water content by mass is (mass of water / mass of dry soil) × 100. This is (20g / 95g) × 100 ≈ 21.05%, which is closest to 21%."
    },
    "q1080-hz3": {
        "answer": "d",
        "explanation": "Earthquake magnitude is a measure of the total energy released at the earthquake's source (hypocenter). It is a single, objective value for the entire event and does not change with distance. In contrast, intensity, which measures the effects of shaking, decreases with distance from the epicenter."
    },
    "q119-hz3": {
        "answer": "d",
        "explanation": "The Carlsberg Ridge, East Pacific Rise, and South East Indian Ridge are all active mid-ocean spreading centers, which are divergent plate boundaries. The Ninety East Ridge, however, is an aseismic ridge in the Indian Ocean, interpreted as a hotspot track, not a current plate boundary."
    },
    "q188-hz3": {
        "answer": "a",
        "explanation": "Sea floor spreading, subduction, and mountain building are all processes that occur at plate boundaries and are fundamental to plate tectonic theory. The rise of mantle plumes, which creates hotspots, is a process originating deep in the mantle that is largely independent of plate motions and can occur far from plate boundaries."
    },
    "q499-hz3": {
        "answer": "c",
        "explanation": "Pyroclastic materials (tephra) are classified by size. The correct sequence in ascending order of size is: Volcanic Ash (< 2 mm diameter), Cinder/Lapilli (2 - 64 mm diameter), and Volcanic Bombs or Blocks (> 64 mm diameter)."
    },
    "q649-hz3": {
        "answer": "c",
        "explanation": "A hotspot is a region of persistent volcanic activity often attributed to a mantle plume. While many hotspots are oceanic (e.g., Azores, Easter Island), the Yellowstone hotspot is a prime example of one located beneath a continental plate (the North American Plate)."
    },
    "q520-hz3": {
        "answer": "a",
        "explanation": "While mantle convection provides the overall energy and ridge push contributes, modern geodynamic models indicate that slab pull is the dominant driving force for plate motion. This is the strong gravitational force exerted by a cold, dense oceanic plate as it subducts and sinks into the mantle, pulling the rest of the plate along behind it."
    },
    "q1058-hz3": {
        "answer": "b",
        "explanation": "A four-digit palindromic PIN has the form ABBA. There are 10 possible choices (0-9) for the first digit 'A' and 10 possible choices for the second digit 'B'. The third and fourth digits are then determined (must be B and A, respectively). The total number of combinations is 10 × 10 = 100."
    },
    "q1815-hz3": {
        "answer": "c",
        "explanation": "A foreland basin is a structural basin that develops adjacent and parallel to a mountain belt. The immense weight of the mountains (like the Himalayas) causes the lithosphere to flex downwards, creating a depression that fills with sediments. The Indo-Gangetic Plain is a classic foreland basin related to the Himalayas."
    },
    "q1852-hz3": {
        "answer": "b",
        "explanation": "An object's contribution to gravity is proportional to its mass. The Earth's mantle makes up approximately 84% of the Earth's volume and about 67% of its mass, far more than the crust or core. Therefore, the mantle contributes the most to Earth's total gravitational field."
    },
    "q1851-hz3": {
        "answer": "c",
        "explanation": "Desert soils (Aridisols) form under arid conditions with sparse vegetation, leading to a deficiency in organic matter (humus) and nitrogen. The lack of rainfall and leaching allows for the accumulation of soluble compounds like calcium carbonate and phosphates."
    },
    "q558-hz3": {
        "answer": "b",
        "explanation": "Saprolite is extensively chemically weathered rock that forms in place. It is typically found in the lower zones of soil profiles (the C horizon), situated above the unweathered bedrock and below the more developed soil horizons (A and B). It often retains the original rock structure."
    },
    "q8-hz3": {
        "answer": "c",
        "explanation": "The primary reason for the abundance of silicate minerals is the abundance of their constituent elements. Oxygen and Silicon are the two most common elements in the Earth's crust, making up nearly 75% of its mass. They readily combine to form the stable silica tetrahedron, the basic building block of all silicates."
    },
    "q973-hz3": {
        "answer": "d",
        "explanation": "The color of microscopic organic matter, especially spores and pollen, changes predictably from yellow to brown to black as it is heated during burial. This Thermal Alteration Index (TAI) is a standard method used to estimate the maximum temperature a hydrocarbon source rock has reached, and thus its thermal maturity."
    },
    "q971-hz3": {
        "answer": "d",
        "explanation": "The mineral-crystal system pairs are mostly correct: Spinel is cubic, Olivine is orthorhombic, and Augite is monoclinic. However, Biotite, like other micas, crystallizes in the Monoclinic system, not the Triclinic system. Therefore, this pair is incorrect."
    },
    "q560-hz3": {
        "answer": "a",
        "explanation": "The primary igneous host rocks for natural diamonds are kimberlites and, less commonly, lamproites. These are rare, ultramafic volcanic rocks that originate deep within the mantle and erupt rapidly to the surface, transporting diamonds as xenocrysts."
    },
    "q1853-hz3": {
        "answer": "a",
        "explanation": "The P-wave shadow zone exists because the decrease in velocity at the core-mantle boundary refracts P-waves downward, preventing them from reaching the surface between about 103° and 142° from the epicenter. If the mantle velocity were constant, seismic rays would travel in straight lines, and this refraction-based shadow zone would not exist."
    },
    "q335-hz3": {
        "answer": "b",
        "explanation": "Climate is considered the most influential of the five soil-forming factors. Specifically, precipitation (rainfall) and temperature control the type and rate of chemical weathering and the amount of water available for leaching, which are fundamental to soil development."
    },
    "q257-hz3": {
        "answer": "c",
        "explanation": "The B horizon is the zone of illuviation, or accumulation. Clays, iron oxides, and aluminum oxides leached from the overlying A and E horizons are deposited here. The accumulation of iron oxides (hematite and goethite) gives many B horizons their characteristic reddish or brownish, clay-rich character."
    },
    "q498-hz3": {
        "answer": "a",
        "explanation": "When mafic lava erupts underwater, its outer surface is rapidly quenched by cold seawater, forming a flexible crust. As more lava pushes from within, it creates interconnected, bulbous shapes called pillow basalts or pillow lavas. This structure is diagnostic of submarine eruptions."
    },
    "q242-hz3": {
        "answer": "d",
        "explanation": "Headward erosion is the process by which a stream channel lengthens at its source in an upstream direction. By extending its channel network, the stream is able to capture runoff from a larger area, thereby increasing its overall catchment area."
    },
    "q1879-hz3": {
        "answer": "c",
        "explanation": "First, calculate seismic moment ($M_0$) from magnitude ($M_w$) using $log_{10} M_0 = 1.5 M_w + 9.1$. $log_{10} M_0 = 1.5(6.6) + 9.1 = 19.0$, so $M_0 = 10^{19}$ N·m. Then, use $M_0 = mu A D$ to find slip (D). Area $A = 100 \text{ km} \times 10 \text{ km} = 10^9 \text{ m}^2$. Rigidity $mu = 10 \text{ GPa} = 10^{10} \text{ Pa}$. So, $D = M_0 / (mu A) = 10^{19} / (10^{10} \times 10^9) = 1$ meter."
    },
    "q1884-hz3": {
        "answer": "null",
        "explanation": "This question is flawed as none of the provided options satisfy the condition for an irrotational vector field (where the curl of the vector is zero). The correct calculation for the given vector field F yields constants c1=0, c2=1, and c3=-3, which does not match any of the choices."
    },
    "q1408-1bvv": {
        "answer": "c",
        "explanation": "Limestone, Sandstone, and Conglomerate are all types of sedimentary rocks. Marble is a non-foliated metamorphic rock, formed when limestone is subjected to heat and pressure. Therefore, marble is the different kind of rock in the list."
    },
    "q8170-1bvv": {
        "answer": "d",
        "explanation": "The floating of lithospheric plates on the asthenosphere is governed by isostasy, a principle of gravitational equilibrium. The asthenosphere's plastic, semi-molten nature allows this floating. The movement of these plates is primarily driven by thermal convective currents within the mantle. Thus, all listed factors are involved in the overall process."
    },
    "q2495-1bvv": {
        "answer": "d",
        "explanation": "Terrigenous sediments are derived from the weathering and erosion of rocks on land. Quartz sands and clays are classic examples of terrigenous material transported to the ocean. In contrast, oozes are biogenous (from organisms), and nodules are hydrogenous (precipitated from water)."
    },
    "q881-1bvv": {
        "answer": "c",
        "explanation": "Hydration is a weathering process in which water molecules are absorbed into the crystal structure of minerals. This is a chemical change, but it also causes physical expansion and stress within the rock. Therefore, it is considered both a physical and chemical process."
    },
    "q8165-1bvv": {
        "answer": "a",
        "explanation": "Laurasia was the northern supercontinent formed after the breakup of Pangaea, comprising what would become North America, Europe, and Asia. The Chinese plate is a part of the Eurasian landmass and was therefore a component of Laurasia."
    },
    "q1419-1bvv": {
        "answer": "a",
        "explanation": "In tropical humid conditions, intense chemical weathering (hydrolysis) of feldspar breaks it down into clay minerals. During this process, mobile elements like potassium, sodium, and calcium are leached away in solution, while silica can also be removed, particularly under very high rainfall and drainage conditions, leading to the formation of lateritic soils rich in aluminum and iron."
    },
    "q9455-1bvv": {
        "answer": "d",
        "explanation": "Barchans are crescent-shaped sand dunes that form in arid environments where the wind is consistent in one direction and the sand supply is limited. They have a gentle slope on the windward side and a steep slip face on the leeward side."
    },
    "q1386-1bvv": {
        "answer": "b",
        "explanation": "A delta is a depositional landform created at the mouth of a river where the river's flow velocity decreases upon entering a body of standing water (like a sea or lake), causing it to deposit its sediment load. Often, the river splits into smaller channels called distributaries, forming a triangular landmass."
    },
    "q2857-1bvv": {
        "answer": "b",
        "explanation": "Assertion (A) is true; geographers define regions as areas with homogeneous characteristics, like the Thar desert. Reason (R) is false; the entire concept of a region is that it *does* have a distinct personality or character on the ground, which is what allows it to be identified and studied."
    },
    "q2744-1bvv": {
        "answer": "b",
        "explanation": "The general direction of movement for these plates is: (A) Nazca plate moves east, subducting under South America. (B) Pacific plate moves generally northwest. (C) Cocos plate moves northeast, subducting under North America. (D) Indo-Australian Plate moves north. The option (IV) East-South East for Nazca, (I) North-West for Pacific, (III) North east for Cocos, and (II) North for Indo-Australian is the best match among the choices."
    },
    "q3499-1bvv": {
        "answer": "c",
        "explanation": "Alfred Wegener proposed two main forces for continental drift: 'pole-fleeing force' (from Earth's rotation) and tidal force (from the gravitational pull of the Sun and Moon). He believed these forces were strong enough to move continents, although this mechanism was later proven to be insufficient."
    },
    "q8652-1bvv": {
        "answer": "a",
        "explanation": "The landforms are created by specific agents of denudation: (A) Drumlin is a depositional feature of a glacier. (B) Monadnocks are erosional remnants in a landscape shaped by a river. (C) A Blind Valley is a characteristic feature of karst topography, formed by groundwater. (D) Dreikanters are rocks shaped by wind abrasion."
    },
    "q9980-1bvv": {
        "answer": "c",
        "explanation": "The term 'peneplain' was introduced by the American geographer and geomorphologist William Morris Davis as part of his cycle of erosion theory. It describes a low-relief plain formed as the end-product of prolonged fluvial erosion."
    },
    "q8696-1bvv": {
        "answer": "b",
        "explanation": "A ria is a coastal inlet formed by the partial submergence of an unglaciated river valley. It is a type of drowned river valley, which classifies it as a submerged upland shore, where the sea level has risen relative to the land."
    },
    "q1387-1bvv": {
        "answer": "b",
        "explanation": "A strait is a naturally formed, narrow, and typically navigable waterway that connects two larger bodies of water, thereby lying between two landmasses. An isthmus is the opposite: a narrow strip of land connecting two larger landmasses."
    },
    "q2880-1bvv": {
        "answer": "b",
        "explanation": "The Nazca Plate is an oceanic tectonic plate in the eastern Pacific Ocean. It is moving eastwards and subducting beneath the continental South American Plate, a process responsible for the formation of the Andes Mountains."
    },
    "q7455-1bvv": {
        "answer": "c",
        "explanation": "Both statements are correct. An antecedent stream is one that maintains its original course by cutting down through a landform that is being uplifted across its path. Many of the major rivers of the Himalayas, such as the Indus, Sutlej, and Brahmaputra, are classic examples of antecedent rivers."
    },
    "q9252-1bvv": {
        "answer": "c",
        "explanation": "Assertion (A) is false. Fjords, being deep, sheltered, and ice-free inlets, are excellent natural harbors and are suitable locations for ports. Reason (R) is true; it correctly describes a fjord as a drowned glaciated valley. Because the assertion is false, the overall statement is 'A is false but R is true'."
    },
    "q5124-1bvv": {
        "answer": "b",
        "explanation": "A hanging valley is a tributary valley that is perched high above the main valley floor. It forms when a large, powerful main glacier erodes its valley much deeper than the smaller, less powerful tributary glacier erodes its valley. After the glaciers melt, the tributary valley is left 'hanging'."
    },
    "q1984-1bvv": {
        "answer": "c",
        "explanation": "A consequent stream's course is determined by the initial slope of the land. In contrast, an insequent stream is one that develops on a surface of uniform resistance, and its course is not controlled by the original slope, rock type, or structure, appearing to follow a random pattern."
    },
    "q1407-1bvv": {
        "answer": "d",
        "explanation": "Plutonic rocks are a type of intrusive igneous rock that solidifies from magma slowly beneath the Earth's surface. Granite is the classic example of a coarse-grained, plutonic igneous rock. Basalt is extrusive, while slate and dolomite are metamorphic and sedimentary, respectively."
    },
    "q8747-1bvv": {
        "answer": "b",
        "explanation": "Marble is a metamorphic rock formed when limestone, a sedimentary rock, is subjected to intense heat and pressure. This process causes the calcite in the limestone to recrystallize, forming a denser rock with interlocking calcite crystals."
    },
    "q1453-1bvv": {
        "answer": "b",
        "explanation": "The asthenosphere, the plastic layer of the upper mantle upon which the lithospheric plates float, is primarily composed of peridotite. Peridotite is a dense, coarse-grained ultramafic igneous rock consisting mainly of the minerals olivine and pyroxene."
    },
    "q5392-1bvv": {
        "answer": "a",
        "explanation": "Both the assertion and the reason are true, and the reason explains the assertion. Most of the world's active volcanoes are located along plate margins, particularly convergent boundaries (subduction zones), where the melting of the subducting plate generates magma. This close relationship is a cornerstone of plate tectonic theory."
    },
    "q8214-1bvv": {
        "answer": "b",
        "explanation": "An inselberg is an isolated hill or mountain rising abruptly from a plain. It is an erosional remnant formed by the long-term weathering and erosion of the surrounding landscape, primarily through processes like abrasion, corrosion, and deflation by wind and water. Attrition, the process of particles colliding with each other, primarily reduces the size of transported sediment rather than forming large landforms like inselbergs."
    },
    "q2297-1bvv": {
        "answer": "a",
        "explanation": "The term 'panplane' (or panplain) was proposed by C.H. Crickmay to describe a broad, low-relief plain formed by the coalescence of adjacent floodplains due to the lateral erosion of rivers. It is distinct from a peneplain (formed by down-wasting) and a pediplain (formed by scarp retreat)."
    },
    "q7443-1bvv": {
        "answer": "c",
        "explanation": "Assertion (A) is false; it has the relationship backward. Extrusive (volcanic) rocks cool quickly and are fine-grained, while intrusive (plutonic) rocks cool slowly and are coarse-grained. Reason (R) is true; acidic (felsic) igneous rocks are rich in light-colored, lower-density minerals like quartz and feldspar, while basic (mafic) rocks are rich in darker, denser minerals."
    },
    "q5149-1bvv": {
        "answer": "c",
        "explanation": "Barchan dunes are crescent-shaped with their horns pointing downwind. They migrate as wind erodes sand from the gentle windward slope (the back or 'tail') and deposits it on the steep slip face (the front or 'head'). Therefore, the wind direction is from the tail to the head of the dune."
    },
    "q4026-1bvv": {
        "answer": "d",
        "explanation": "Honeycomb and taffoni are intricate weathering features characterized by small pits and cavities on a rock surface. They are predominantly formed by granular disintegration and chemical decay, especially salt weathering, rather than by direct erosion from agents like water or ice."
    },
    "q5474-1bvv": {
        "answer": "d",
        "explanation": "The Greater Himalayas are characterized by high altitudes, steep slopes, and significant daily temperature fluctuations that cross the freezing point. These conditions are ideal for mechanical weathering, specifically frost shattering or block disintegration, where water repeatedly freezes in rock joints and expands, breaking off large blocks of rock."
    },
    "q1432-1bvv": {
        "answer": "c",
        "explanation": "This matching question pairs metamorphic rocks with their parent rocks: (A) Graphite is formed from the metamorphism of (IV) Coal. (B) Marble is formed from (II) Limestone. (C) Quartzite is formed from (III) Sandstone. (D) Slate is formed from (I) Clay or shale."
    },
    "q4121-1bvv": {
        "answer": "c",
        "explanation": "An antecedent drainage pattern develops when a river maintains its original course by actively eroding at the same rate as or faster than the rate of land uplift across its path. This results in the river cutting a deep gorge through the rising landform."
    },
    "q8692-1bvv": {
        "answer": "d",
        "explanation": "This question matches depositional landforms with their formative agents: (A) Silt is typically deposited by a (IV) River. (B) Loess is fine-grained, wind-blown silt, deposited by (I) Wind. (C) Moraines are ridges of till deposited by a (III) Glacier. (D) Dripstones (like stalactites) are formed by precipitation from (II) Underground water in caves."
    },
    "q1414-1bvv": {
        "answer": "b",
        "explanation": "The characteristic red, brown, or yellow colors in many sedimentary rocks, such as red beds, are due to the presence of iron oxides, primarily hematite ($Fe_2O_3$) for red colors and limonite/goethite for yellowish-brown colors. These oxides act as a cement coating the sediment grains."
    },
    "q1640-1bvv": {
        "answer": "d",
        "explanation": "Fjords (or Fiords) are long, deep, narrow sea inlets with steep sides or cliffs, created by the submergence of a glacially-eroded U-shaped valley. They are common in the high-latitude coastal regions of countries like Norway, Greenland, and New Zealand."
    },
    "q9809-1bvv": {
        "answer": "c",
        "explanation": "The consequences of a landslide—such as the area affected, the destructive force, and the potential for damage and loss of life—are primarily dependent on its type (e.g., debris flow, rockfall) and its magnitude (the volume of material and the speed of movement)."
    },
    "q5439-1bvv": {
        "answer": "d",
        "explanation": "A Glacial Lake Outburst Flood (GLOF) involves (1) the sudden release of meltwater from a glacial lake, which is often caused by (2) the failure of its moraine or ice dam. This results in (3) a large downstream discharge, causing catastrophic flooding. The event is rapid but can last for hours or days, not just a few seconds, so statement (4) is incorrect."
    },
    "q1451-1bvv": {
        "answer": "d",
        "explanation": "In the Davisian cycle of erosion, a monadnock is an isolated hill or ridge of resistant rock that remains standing above a peneplain, an extensive low-relief plain that is the final stage of fluvial erosion. Inselbergs are a similar feature but are more typically associated with arid environments."
    },
    "q2175-1bvv": {
        "answer": "a",
        "explanation": "Both the assertion and the reason are true, and the reason correctly explains the assertion. Humid tropical regions experience intense and deep chemical weathering of rocks because the high temperatures accelerate chemical reaction rates, and abundant water acts as a crucial medium and reactant for these processes."
    },
    "q7076-1bvv": {
        "answer": "b",
        "explanation": "This matches the Mercalli Intensity Scale with corresponding Richter Magnitudes that could produce that level of shaking. VI (Strong) corresponds to M 4.9-5.4. X (Disastrous) corresponds to M 7.0-7.3. VII (Very Strong, but often labeled Destructive) corresponds to M 6.2. XII (Catastrophic) corresponds to M > 8.1. The correct sequence is A-III, B-II, C-IV, D-I."
    },
    "q5661-1bvv": {
        "answer": "d",
        "explanation": "Fluvial (river) erosion involves several processes. Corrasion (or abrasion) is the scraping and grinding action of the river's sediment load. Corrosion (or solution) is the chemical dissolving of rock. Cavitation is the erosion caused by the implosion of air bubbles in fast-flowing water. Therefore, all three are valid processes."
    },
    "q1417-1bvv": {
        "answer": "d",
        "explanation": "This matches parent rocks with their metamorphic equivalents: (A) Limestone metamorphoses into (II) Marble. (B) Sandstone metamorphoses into (I) Quartzite. (C) Granite metamorphoses into (III) Gneiss. (D) Basalt metamorphoses into (IV) Greenstone or amphibolite."
    },
    "q2368-1bvv": {
        "answer": "a",
        "explanation": "A ria is a coastal inlet formed by the partial submergence of an unglaciated river valley, where sea level has risen relative to the land. This classifies it as a type of submerged upland shore."
    },
    "q1427-1bvv": {
        "answer": "b",
        "explanation": "Permeability is the measure of a rock or sediment's ability to transmit fluids, such as water. It depends on the size and interconnectedness of the pore spaces. Porosity, in contrast, is the measure of the void space within a rock."
    },
    "q5574-1bvv": {
        "answer": "c",
        "explanation": "The term 'panplane' was coined by geomorphologist C.H. Crickmay to describe a broad, flat plain created in an arid or semi-arid environment by the lateral shifting of streams and the coalescence of their floodplains."
    },
    "q8162-1bvv": {
        "answer": "b",
        "explanation": "Alfred Wegener, a German meteorologist, first published his comprehensive theory of continental drift in 1915 in his book titled 'Die Entstehung der Kontinente und Ozeane', which translates to 'The Origin of Continents and Oceans'."
    },
    "q2374-1bvv": {
        "answer": "a",
        "explanation": "Assertion (A) is true; Hawaii is a classic example of hotspot volcanism. Reason (R) is also true; convergent plate margins (subduction zones) are indeed sites of major volcanic activity. However, the reason does not explain the assertion. Hawaiian volcanism is caused by a mantle plume (a hotspot) in the middle of a plate, not by a convergent plate margin. Thus, both are true but R is not the correct explanation for A."
    },
    "q1426-1bvv": {
        "answer": "a",
        "explanation": "Both statements are true and the reason correctly explains the assertion. Clay consists of very fine particles, creating a large volume of tiny pore spaces (high porosity). However, these pores are very poorly connected, which prevents water from flowing through easily, making the clay impermeable."
    },
    "q8157-1bvv": {
        "answer": "d",
        "explanation": "Landslides, the downslope movement of rock and debris, can cause all of the listed effects. They can directly cause property damage, fill reservoirs and river channels (making them shallow), and block drainage leading to water logging. Thus, all of the choices are potential consequences."
    },
    "q2886-1bvv": {
        "answer": "d",
        "explanation": "The theory of continental drift explains how the continents have moved over geological time. The breakup of the supercontinent Pangaea during the Mesozoic Era allowed previously connected terrestrial faunas, including dinosaurs, to become dispersed and isolated on the newly separating landmasses, leading to divergent evolution."
    },
    "q3503-1bvv": {
        "answer": "c",
        "explanation": "Mechanical (or physical) weathering breaks rocks into smaller pieces without changing their chemical composition. Frost action, unloading (pressure release), and hydraulic action are all forms of mechanical weathering. Hydrolysis is a form of chemical weathering where water chemically reacts with minerals."
    },
    "q3637-1bvv": {
        "answer": "d",
        "explanation": "Glacio-fluvial landforms are created by meltwater from glaciers. Kames, Drumlins (partially), and Eskers are all depositional features formed by glacial meltwater. A horn is a sharp-pointed peak formed by glacial erosion (plucking and abrasion) when several cirques erode back to back."
    },
    "q4067-1bvv": {
        "answer": "c",
        "explanation": "In a subduction zone, the distribution of earthquake foci (hypocenters) forms an inclined plane known as a Wadati-Benioff zone. The angle of this zone, determined by plotting the depth of earthquake foci against distance from the trench, directly reflects the dip or slope of the subducting plate as it slides into the asthenosphere."
    },
    "q1396-1bvv": {
        "answer": "c",
        "explanation": "While both lakes and tanks are inland bodies of water, the term 'lake' generally refers to a large, naturally formed body of water. A 'tank' is typically a man-made reservoir, often created by building a dam or bund, for purposes like irrigation or water storage."
    },
    "q2245-1bvv": {
        "answer": "a",
        "explanation": "Whalebacks, or sand ridges, are very large, elongated sand dunes that are oriented parallel to the prevailing wind direction. They are a feature of sand seas (ergs) where sand supply is abundant. Seifs are also longitudinal but have a more sinuous, sharp crest."
    },
    "q7355-1bvv": {
        "answer": "a",
        "explanation": "J. Tuzo Wilson proposed an idealized cycle for the opening and closing of ocean basins. In this cycle, the juvenile stage is characterized by the initial rifting of a continent and the formation of a narrow, linear sea. The Red Sea is the classic modern example of an ocean basin in its juvenile stage."
    },
    "q5430-1bvv": {
        "answer": "b",
        "explanation": "The element of image interpretation that relies on the general form, configuration, or outline of individual objects is 'shape'. Alluvial fans have a distinct fan shape, and meanders have a characteristic sinuous or looping shape, making them readily identifiable on aerial or satellite photographs."
    },
    "q1418-1bvv": {
        "answer": "d",
        "explanation": "Feldspars are a group of aluminosilicate minerals. Their chemical formula framework always contains aluminum and silicon oxides. The specific type of feldspar is determined by the presence of other cations, primarily potassium (K), sodium (Na), and calcium (Ca). Iron (Fe) is not an essential constituent of the main feldspar minerals."
    },
    "q1416-1bvv": {
        "answer": "d",
        "explanation": "Rock salt (halite), anhydrite, and gypsum are all minerals that precipitate directly from the evaporation of saline water, such as in a restricted sea or a desert lake. Sedimentary rocks formed predominantly from these minerals are known as evaporite deposits."
    },
    "q5621-1bvv": {
        "answer": "b",
        "explanation": "In his theory of continental drift, Alfred Wegener proposed two primary driving forces: a 'pole-fleeing' force due to Earth's rotation and the tidal force exerted by the gravitational pull of the Sun and Moon. He incorrectly believed these forces were sufficient to move continents."
    },
    "q1409-1bvv": {
        "answer": "b",
        "explanation": "Igneous rocks are classified based on their silica ($SiO_2$) content. Those with a high percentage of silica (typically >63%) are termed 'acidic' or 'felsic'. While they are also rich in quartz, 'silica' is the defining chemical component for this classification."
    },
    "q1944-1bvv": {
        "answer": "d",
        "explanation": "The Red Sea is a young ocean basin forming where the Arabian Plate is splitting away from the African Plate. This process involves continental rifting (splitting), down-faulting to create the rift valley, and thinning of the crust, which will eventually lead to seafloor spreading. All listed options are part of this process."
    },
    "q2008-1bvv": {
        "answer": "a",
        "explanation": "A superimposed (or superposed) drainage pattern is one that was established on a younger layer of rocks and has subsequently cut down through them, maintaining its course regardless of the structure of the older, underlying rocks it encounters."
    },
    "q1639-1bvv": {
        "answer": "c",
        "explanation": "A rift valley is a linear lowland created by the action of a geologic rift or fault. It is formed by tectonic forces causing the crust to extend and pull apart, leading to a block of land dropping down between two parallel normal faults. Hanging valleys are glacial features."
    },
    "q9542-1bvv": {
        "answer": "a",
        "explanation": "The theory of sea floor spreading was developed decades after Wegener's Continental Drift Theory and provided the mechanism that Wegener was missing. The concepts of Panthalassa (the superocean), paleoclimatic evidence, and the 'jigsaw fit' of continents were all key pieces of evidence used by Wegener himself."
    },
    "q2015-1bvv": {
        "answer": "b",
        "explanation": "Assertion (A) is true: Divergent plate margins are where new oceanic crust is formed, causing sea floor spreading. Reason (R) is false: Constructional (constructive) plate margins are divergent boundaries characterized by rifting and volcanism, not the compressional faults (thrust faults) associated with destructive margins."
    },
    "q1411-1bvv": {
        "answer": "d",
        "explanation": "Sedimentary rocks formed from the broken fragments (clasts or detritus) of pre-existing rocks are known as both clastic and detrital sedimentary rocks. These terms are used interchangeably. Non-clastic rocks are formed by chemical or biological processes."
    },
    "q9465-1bvv": {
        "answer": "b",
        "explanation": "(A) Denudation is the overall process of stripping the land surface, which includes weathering, mass wasting, and erosion. Correct. (B) Physical and Mechanical weathering are synonymous terms. Incorrect. (C) Salt crystal growth in arid climates creates tafoni and other hollows. Correct. (D) Exfoliation is primarily due to pressure release, not daily temperature changes. Incorrect. Therefore, (A) and (C) are the correct statements."
    },
    "q1392-1bvv": {
        "answer": "c",
        "explanation": "A tributary is a freshwater stream or river that flows into and joins a larger river (the main stem). Tributaries do not flow directly into the sea."
    },
    "q9984-1bvv": {
        "answer": "a",
        "explanation": "River meanders evolve over time through several processes. (B) They migrate laterally across the floodplain through erosion on the outer bank and deposition on the inner bank. (C) They can become highly exaggerated until the narrow neck is cut off, forming an ox-bow lake. (D) If the land is uplifted, the river can cut down, preserving the meandering pattern as intrenched or ingrown meanders. Meanders migrate downstream, not upstream (A)."
    },
    "q3894-1bvv": {
        "answer": "d",
        "explanation": "A barchan is a classic crescent-shaped sand dune that is formed by wind action in arid environments. It has a convex windward slope and a concave leeward slope (slip face)."
    },
    "q1807-1bvv": {
        "answer": "d",
        "explanation": "All four features listed are related to mountain (or alpine) glaciation. Cirques, tarns (lakes within cirques), and arêtes (sharp ridges between cirques) are all erosional features. Fjords are glacially-carved valleys that have been drowned by the sea. Therefore, all of the options are correct."
    },
    "q1465-1bvv": {
        "answer": "c",
        "explanation": "The Red River of the North, which flows northward through the United States and Canada, has a very extensive and flat lacustrine plain. This plain is the former bed of Glacial Lake Agassiz, a massive proglacial lake from the last ice age."
    },
    "q2995-1bvv": {
        "answer": "d",
        "explanation": "The key characteristics of sedimentary rocks are that they (2) often contain fossils and (4) are typically formed in water bodies where sediment accumulates. They are generally layered (unlike statement 3) and are not volcanic in origin (statement 1 is incorrect)."
    },
    "q2866-1bvv": {
        "answer": "c",
        "explanation": "Paternoster lakes are a series of small, circular glacial lakes connected by a single stream, resembling beads on a string. They form in glacial valleys where the glacier has eroded a series of rock basins, creating what is known as a glacial stairway."
    },
    "q1406-1bvv": {
        "answer": "a",
        "explanation": "Tuff is a type of rock formed from the consolidation and cementation of volcanic ash and other fine-grained pyroclastic materials ejected during a volcanic eruption."
    },
    "q879-1bvv": {
        "answer": "d",
        "explanation": "The 'active layer' is the top layer of soil or rock in a permafrost region that thaws during the summer and freezes again during the winter. It is a key concept in the study of periglacial processes and landscapes."
    },
    "q3858-1bvv": {
        "answer": "d",
        "explanation": "The Antarctica plate is almost entirely surrounded by divergent plate boundaries, specifically the Pacific-Antarctic Ridge, the Southeast Indian Ridge, and the Southwest Indian Ridge. These are spreading centers where new oceanic crust is being formed."
    },
    "q2632-1bvv": {
        "answer": "c",
        "explanation": "Matching the plain types to their definitions: (A) A plain formed by wind action is a (II) Loess Plain. (B) A deep sea plain is an (I) Abyssal Plain. (C) A plain composed of recent alluvium is a (III) Flood plain. (D) A level surface covered with thin alluvium, formed by erosion in an arid region, is a (IV) Pediplain."
    },
    "q8708-1bvv": {
        "answer": "a",
        "explanation": "The assertion is true: the Aleutian Islands are a volcanic island arc. The reason is also true: convergent plate margins, specifically subduction zones, are the sites of this type of volcanism. The reason correctly explains the assertion, as the Aleutian arc is formed by the subduction of the Pacific Plate beneath the North American Plate."
    },
    "q1431-1bvv": {
        "answer": "a",
        "explanation": "This question matches depositional materials with their depositing agent: (A) Loess is fine silt deposited by (II) Wind. (B) Moraines are till deposited by (III) Glaciers. (C) Sand and clay are common (I) Sea deposited (marine) sediments. (D) Gravels are typically deposited by (IV) Rivers."
    },
    "q3100-1bvv": {
        "answer": "b",
        "explanation": "Assertion (A) is true; extrusive igneous rocks form from lava solidifying on the Earth's surface. Reason (R) is false; Granite is a classic example of an intrusive (plutonic) rock, which cools slowly beneath the surface. Basalt is a common extrusive rock."
    },
    "q9950-1bvv": {
        "answer": "b",
        "explanation": "This matches types of river transport with their definitions: (A) Flotation carries light debris like (III) leaves on the surface. (B) Saltation involves particles (II) bouncing along the riverbed. (C) Traction is when the heaviest material is (IV) dragged or rolled along the bed. (D) Solution is when the load is (I) dissolved in the water."
    },
    "q3494-1bvv": {
        "answer": "b",
        "explanation": "In dry (arid) locations, the lack of water limits the effectiveness of chemical weathering. Therefore, physical weathering processes, such as thermal expansion and contraction (insolation weathering) and salt crystal growth, tend to be the dominant forces breaking down rocks."
    },
    "q9223-1bvv": {
        "answer": "c",
        "explanation": "The term peneplain, as defined by W. M. Davis, refers to a low-relief land surface that is the theoretical end product of a complete cycle of fluvial erosion, representing the 'old age' stage of landscape development."
    },
    "q1603-1bvv": {
        "answer": "b",
        "explanation": "The formation of coastal sand dunes by wind (aeolian transport) is most efficient for sand grains of a specific size. Fine to medium sand, with a diameter of approximately 0.25 mm, is most easily moved and deposited by typical wind speeds."
    },
    "q2295-1bvv": {
        "answer": "b",
        "explanation": "A Karst region is a landscape formed from the dissolution of soluble rocks, primarily limestone. The dominant weathering process is carbonation, where carbonic acid (formed from carbon dioxide and water) chemically dissolves the calcium carbonate in the limestone."
    },
    "q9471-1bvv": {
        "answer": "d",
        "explanation": "Matching the earthquakes with their tectonic environments: (A) Mexico City is vulnerable to waves from the (I) Subduction zone offshore. (B) San Francisco is on the (IV) Transform boundary of the San Andreas Fault. (C) Java is part of the Sunda Arc, a major (III) Undersea subduction zone. (D) The Bam earthquake in Iran was caused by rupture on (II) Blind faults (faults that do not reach the surface)."
    },
    "q2587-1bvv": {
        "answer": "d",
        "explanation": "An esker is a long, sinuous ridge composed of sand and gravel. It is believed to have formed from the deposits of a stream flowing in a tunnel within, under, or upon a melting glacier. When the glacier disappears, the stream deposit is left behind as a ridge."
    },
    "q1593-1bvv": {
        "answer": "c",
        "explanation": "A ria is a coastal landform created when a river valley is drowned by a rise in sea level. It is a type of submerged upland shoreline, characterized by a V-shaped cross-section that becomes wider and deeper towards the sea."
    },
    "q4509-1bvv": {
        "answer": "d",
        "explanation": "According to Alfred Wegener's theory, the supercontinent Pangaea was surrounded by a superocean called Panthalassa. As Pangaea began to break apart, a large, wedge-shaped sea called the Tethys Sea opened up between the northern continent (Laurasia) and the southern continent (Gondwanaland)."
    },
    "q1986-1bvv": {
        "answer": "a",
        "explanation": "A horn is a sharp-pointed peak formed by glacial erosion. Kames, drumlins, and eskers are all depositional landforms created by meltwater and ice from glaciers (glacio-fluvial deposits). A horn is purely an erosional feature."
    },
    "q1397-1bvv": {
        "answer": "a",
        "explanation": "While the Ganga-Brahmaputra delta is the largest in the world by area, the Mississippi River Delta is also enormous and known for its distinctive bird-foot shape, built by the deposition of vast amounts of sediment into the Gulf of Mexico. Among the choices, it's often cited as an example of a very large delta system."
    },
    "q9238-1bvv": {
        "answer": "a",
        "explanation": "Alfred Wegener was a meteorologist and climatologist. A primary motivation for his Continental Drift Theory was to explain evidence of major climatic changes in the geological past, such as finding coal deposits (formed in tropical swamps) in Antarctica and evidence of glaciation in present-day tropical regions."
    },
    "q1434-1bvv": {
        "answer": "a",
        "explanation": "Sedimentary rocks are classified by grain size. In ascending order (smallest to largest), the sequence is: (iii) Clays (<0.004 mm), (iv) Silts (0.004-0.06 mm), (ii) Sands (0.06-2 mm), (i) Gravels and (v) Breccia (>2 mm). Breccia has angular clasts, while gravels (in conglomerate) have rounded clasts, but they are in the same size class."
    },
    "q8698-1bvv": {
        "answer": "b",
        "explanation": "Osmosis is the net movement of water molecules across a selectively permeable membrane (like a plant root cell membrane) from a region of higher water potential to a region of lower water potential. This is the primary process by which plant roots absorb water from the soil."
    },
    "q3891-1bvv": {
        "answer": "d",
        "explanation": "Matching weathering processes to landforms: (A) Pressure release leads to the formation of (III) Exfoliation domes. (B) Spheroidal weathering attacks corners and edges of rock blocks, leading to rounded forms like (I) Tors. (C) Salt crystal growth creates cavities like (IV) Tafoni. (D) Thermal expansion and contraction can cause (II) Mass exfoliation or sheeting."
    },
    "q9137-1bvv": {
        "answer": "a",
        "explanation": "A wind gap is a notch or pass in a ridge that has no stream flowing through it. It is typically formed when a stream that once flowed through the gap is captured by another stream that has a lower base level and has eroded headward more aggressively. The original valley is thus abandoned, leaving a 'gap'."
    },
    "q5532-1bvv": {
        "answer": "c",
        "explanation": "The Nazca Plate is an oceanic tectonic plate located in the eastern Pacific Ocean basin, off the coast of South America. It is subducting beneath the South American Plate to the east."
    },
    "q8219-1bvv": {
        "answer": "b",
        "explanation": "A hydrograph is a graph that shows the rate of flow (discharge) versus time past a specific point in a river, channel, or conduit. It is a fundamental tool in hydrology for analyzing river flow and runoff."
    },
    "q1421-1bvv": {
        "answer": "a",
        "explanation": "The two most important characteristics used to classify rocks and determine their origin are their composition (the minerals they contain) and their texture (the size, shape, and arrangement of the mineral grains). These two features provide key clues about the rock's formation environment."
    },
    "q4025-1bvv": {
        "answer": "c",
        "explanation": "Wind transports sediment in three ways: suspension (fine particles carried in the air), saltation (particles bouncing along the surface), and surface creep or drag (larger particles rolling or sliding). Solution, the transport of dissolved material, is a process associated with water, not wind."
    },
    "q1985-1bvv": {
        "answer": "b",
        "explanation": "In coastal terminology, 'swash' is the turbulent layer of water that washes up on the beach after an incoming wave has broken. The water that flows back down the beach is called the 'backwash'."
    },
    "q4024-1bvv": {
        "answer": "b",
        "explanation": "An esker is a long, sinuous, elevated ridge of sand and gravel, a depositional landform from a subglacial stream. An 'egg-shaped hill' of glacial origin is the description of a drumlin, not an esker. The other statements about the esker are correct."
    },
    "q4515-1bvv": {
        "answer": "b",
        "explanation": "Gara (mushroom rock), dreikanter, and inselbergs are all erosional landforms created by wind and weathering in arid environments. Barkhans (barchans) are crescent-shaped dunes and are a type of depositional landform, not erosional."
    },
    "q4122-1bvv": {
        "answer": "b",
        "explanation": "Ventifacts are rocks that have been abraded, pitted, etched, grooved, or polished by wind-driven sand or ice crystals. Rocks with three abraded faces are a specific type of ventifact called a dreikanter, which can resemble miniature pyramids."
    },
    "q5172-1bvv": {
        "answer": "b",
        "explanation": "This statement incorrectly describes divergent and convergent boundaries. At divergent boundaries, plates move apart and new crust is formed. At convergent boundaries, subduction carries plates into the mantle. The statement swaps these two processes, making it incorrect."
    },
    "q931-1bvv": {
        "answer": "c",
        "explanation": "The theory of sea-floor spreading was independently proposed by Harry Hess and Robert Dietz in the early 1960s. Their hypothesis provided the crucial mechanism for continental drift, which had been missing from Alfred Wegener's original theory."
    },
    "q2373-1bvv": {
        "answer": "a",
        "explanation": "While several geomorphologists contributed to the study of pediments, the 'lateral planation theory' is most strongly associated with G.K. Gilbert. He proposed that pediments are formed by the erosion and lateral planation of streams emerging from mountain fronts."
    },
    "q1878-1bvv": {
        "answer": "c",
        "explanation": "All four characteristics are true of sedimentary rocks. They are (1) typically layered or stratified, (2) are the only rock type to contain abundant fossils, (3) are formed from transported sediment, and (4) are most commonly formed in water bodies like oceans, lakes, and rivers where this sediment accumulates."
    },
    "q1473-1bvv": {
        "answer": "b",
        "explanation": "An intermontane plateau is a high plateau that is bordered by mountains. The Tibetan Plateau, surrounded by the Himalayas and other ranges, and the Altiplano in the Andes are classic examples of intermontane plateaus."
    },
    "q4902-1bvv": {
        "answer": "d",
        "explanation": "Meanders tend to form in rivers with (2) gentle gradients. The (1) general absence of stabilizing vegetation on the banks can also promote bank erosion and meander development. High velocity (3) is more characteristic of straight, steep, erosive channels in the river's upper course, not the meandering middle course."
    },
    "q4419-1bvv": {
        "answer": "b",
        "explanation": "All four statements are correct. Moraines and drumlins are depositional landforms created by glaciers. Cirques (armchair-shaped hollows) and horns (sharp peaks) are erosional features carved by glaciers in mountainous terrain."
    },
    "q3280-1bvv": {
        "answer": "a",
        "explanation": "Fold-and-thrust mountain belts, such as the Andes and the Himalayas, are formed by the intense compression and deformation that occurs at convergent plate boundaries. These mountain systems are generally aligned parallel to the subduction zones or continental collision zones that create them."
    },
    "q2385-1bvv": {
        "answer": "b",
        "explanation": "Matching the features with their approximate densities (in g/cm³): (A) Continental margin sediment is variable, but 2.4 is a reasonable average. (B) Continental crust (granitic) is ~2.8 g/cm³. (C) Oceanic crust (basaltic) is denser, ~2.9 g/cm³. (D) Sea water is ~1.03 g/cm³. The sequence A-II, B-IV, C-I, D-III is not an option. Re-evaluating based on options: (A) Continental Margin (II) 2.4; (B) Continental Crust (IV) 2.8; (C) Oceanic Crust (I) 2.9; (D) Sea Water (III) 1.03. This matches option (b)."
    },
    "q1472-1bvv": {
        "answer": "b",
        "explanation": "Lacustrine plains are landforms created by the deposition of sediments in a lake bed. Over time, a lake can be completely filled with sediment, leaving behind a flat, fertile plain. The former bed of Glacial Lake Agassiz in North America is a vast lacustrine plain."
    },
    "q2296-1bvv": {
        "answer": "d",
        "explanation": "This matches rivers with their delta types: (A) The Ganga River forms a large (IV) Arcuate delta. (B) The Mississippi River is the classic example of a (II) Bird's-foot delta. (C) The Tiber River in Italy forms a (III) Cuspate delta. (D) The Nile River also forms a famous (I) Arcuate delta."
    },
    "q1809-1bvv": {
        "answer": "b",
        "explanation": "Key evidence used by Alfred Wegener for his continental drift theory included (1) the 'jigsaw puzzle' fit of continents like South America and Africa, and (3) the discovery of identical fossils of land-dwelling animals and plants on these now-separated continents. Trans-current faults and mantle convection were concepts developed later as part of plate tectonics."
    },
    "q4901-1bvv": {
        "answer": "b",
        "explanation": "This statement is wrong. U-shaped valleys are characteristic features of glacial erosion, not erosion by sea waves. A large valley glacier carves a distinctive flat-bottomed, steep-sided U-shaped trough. The other statements are correct."
    },
    "q4011-1bvv": {
        "answer": "b",
        "explanation": "The Lambert Glacier in Antarctica is the largest glacier in the world. It is approximately 400 kilometers (250 miles) long and over 100 kilometers (60 miles) wide, flowing from the Antarctic ice sheet to the Amery Ice Shelf."
    },
    "q9877-1bvv": {
        "answer": "b",
        "explanation": "This group consists entirely of erosional landforms. Zeugen are mushroom-shaped rocks formed by wind abrasion in deserts. Truncated spurs are ridges that have been cut off by a valley glacier. Lapies are solutional features on limestone surfaces in karst topography."
    },
    "q5640-1bvv": {
        "answer": "b",
        "explanation": "The four major glacial stages of the Pleistocene Ice Age in the Alps are named, in correct chronological order from oldest to youngest: Günz, Mindel, Riss, and Würm."
    },
    "q4123-1bvv": {
        "answer": "c",
        "explanation": "The theory of plate tectonics successfully explains the large-scale features of the Earth, including the distribution of continents and oceans, submerged mountain systems (mid-ocean ridges), and the global distribution of earthquakes and volcanoes. It does not, however, explain the specific distribution of all igneous rocks, especially those formed by intraplate (hotspot) volcanism."
    },
    "q1877-1bvv": {
        "answer": "b",
        "explanation": "Rejuvenation is the process by which a river resumes down-cutting, often triggered by a drop in its base level (the lowest point to which it can erode). A negative movement (fall) in sea level is a primary cause of river rejuvenation, leading to the formation of features like incised meanders and river terraces."
    },
    "q5662-1bvv": {
        "answer": "b",
        "explanation": "The Du Boys equation is a classic formula in sediment transport that relates the tractive force (or shear stress) exerted by flowing water on the streambed to the depth and slope of the water. It is used to predict the initiation of sediment motion."
    },
    "q7077-1bvv": {
        "answer": "d",
        "explanation": "This group contains only erosional landforms. A corrie (or cirque) is carved by a glacier. A yardang is shaped by wind erosion. A gorge is cut by a river. Sinkholes are formed by the dissolution of rock by groundwater. The other options contain a mix of erosional and depositional features."
    },
    "q2371-1bvv": {
        "answer": "c",
        "explanation": "Matching dune types with their specific names and characteristics: (A) Transverse dunes, like (II) Barchans, form perpendicular to the wind. (B) Parabolic dunes are U-shaped and often form as blowouts in (III) Coastal areas. (C) Longitudinal dunes, like (IV) Seifs, are long ridges parallel to the wind. (D) Complex dunes, like (I) Reversing dunes, form in areas with variable wind directions."
    },
    "q1422-1bvv": {
        "answer": "d",
        "explanation": "Acid (or felsic) igneous rocks have a high silica content. Granite, andesite, and rhyolite are all examples of rocks with intermediate to high silica content. Basalt is a basic (or mafic) igneous rock, characterized by a low silica content and a high content of iron and magnesium."
    },
    "q3954-1bvv": {
        "answer": "d",
        "explanation": "All four factors listed are crucial in controlling the formation and type of sand dunes. The morphology of a dune is a result of the interplay between the (I) amount of available sand, the (II) velocity and (III) constancy of the wind, and the (IV) presence or absence of vegetation which can stabilize the sand."
    },
    "q3101-1bvv": {
        "answer": "a",
        "explanation": "A batholith is a very large mass of intrusive igneous rock, typically granite, that forms from cooled magma deep in the Earth's crust. They are often exposed at the surface only after extensive erosion of the overlying rocks."
    },
    "q9654-1bvv": {
        "answer": "b",
        "explanation": "This option lists only erosional landforms. Corries (cirques) are carved by glaciers. Yardangs are sculpted by wind. Gorges are cut by rivers. Sinkholes are formed by groundwater dissolution. The other options contain a mix of erosional and depositional features (e.g., moraines, beaches, stalagmites)."
    },
    "q5523-1bvv": {
        "answer": "a",
        "explanation": "The Circum-Pacific Volcanic Belt, or 'Ring of Fire', is a zone of intense seismic and volcanic activity surrounding the Pacific Ocean. It includes the Aleutian Islands, Sakhalin, and Mindanao. The Azores islands are located on the Mid-Atlantic Ridge, a divergent boundary, and are not part of the Ring of Fire."
    },
    "q891-1bvv": {
        "answer": "a",
        "explanation": "A wave-cut platform is a relatively flat, bench-like surface left behind at the base of a sea cliff as it retreats due to wave erosion. This feature is common along emergent or tectonically active coastlines, such as the coast of California."
    },
    "q4514-1bvv": {
        "answer": "b",
        "explanation": "A cirque is an amphitheater-like hollow formed at the head of a valley glacier by glacial erosion. The steep, often near-vertical, cliff at the back of the cirque is known as the headwall."
    },
    "q3624-1bvv": {
        "answer": "b",
        "explanation": "In an arid basin-and-range environment, streams deposit sediment in alluvial fans at the base of mountains. When several of these alluvial fans grow and merge together, they form a continuous, gently sloping depositional surface along the mountain front called a bajada."
    },
    "q1423-1bvv": {
        "answer": "b",
        "explanation": "Steatite, commonly known as soapstone, is a metamorphic rock composed predominantly of the mineral talc. It is very soft and easily carved, and has been used for this purpose for thousands of years."
    },
    "q3953-1bvv": {
        "answer": "a",
        "explanation": "The assertion is a fundamental principle of plate tectonics. The reason correctly identifies the ultimate driving mechanism: convection currents in the molten material of the asthenosphere cause the overlying tectonic plates to move. The reason correctly explains the assertion."
    },
    "q9548-1bvv": {
        "answer": [
            "a",
            "b",
            "d"
        ],
        "explanation": "These are the 'Panch Prayag' (five confluences) in the Himalayas. (a) Devprayag is the confluence of Bhagirathi and Alaknanda. (b) Rudraprayag is where Mandakini joins Alaknanda. (d) Vishnuprayag is where Dhauliganga joins Alaknanda. (c) is incorrect; Karnprayag is the confluence of the Pindar River and the Alaknanda."
    },
    "q5350-1bvv": {
        "answer": "d",
        "explanation": "Yardangs are wind-eroded ridges, and their composition depends on the local geology. Matching the locations to known lithology: (A) Afghanistan - (IV) Clay (lake beds); (B) Saudi Arabia - (III) Eocene Limestone; (C) Jaisalmer, India - (I) Caliche limestone; (D) Sinai - (II) Nubian Sandstone."
    },
    "q2011-1bvv": {
        "answer": "a",
        "explanation": "Assertion (A) is true; humid tropical regions are characterized by deep chemical weathering. Reason (R) is also true; the rate of chemical reactions is controlled by temperature and the availability of water. The reason perfectly explains the assertion, as the combination of high temperatures and abundant water in the tropics maximizes the intensity of chemical weathering."
    },
    "q2487-1bvv": {
        "answer": "b",
        "explanation": "A nunatak is an exposed, often rocky, peak, ridge, or mountain that protrudes from an ice field or glacier that otherwise covers most of the land. It is essentially an island of rock within a sea of ice."
    },
    "q2585-1bvv": {
        "answer": "c",
        "explanation": "Karst topography develops in regions with soluble bedrock, typically limestone. The primary weathering process responsible for dissolving the rock and creating features like caves and sinkholes is carbonation, where carbonic acid (formed from water and carbon dioxide) reacts with calcium carbonate."
    },
    "q2484-1bvv": {
        "answer": "d",
        "explanation": "A levee is a natural or artificial embankment parallel to a river channel. Natural levees are depositional features built up by the repeated deposition of coarse sediment along the river banks during floods."
    },
    "q1420-1bvv": {
        "answer": "d",
        "explanation": "Igneous rocks are formed from the cooling of magma or lava. They do not contain fossils, are crystalline, and may or may not contain iron. However, they do not inherently occur in layers; layering (stratification) is a characteristic feature of sedimentary rocks."
    },
    "q1424-1bvv": {
        "answer": "a",
        "explanation": "Granite is a common, coarse-grained, intrusive (plutonic) igneous rock. Its slow cooling beneath the surface allows large crystals to grow. It is felsic, composed mainly of quartz and feldspar, with smaller amounts of mica and other minerals."
    },
    "q4500-1bvv": {
        "answer": "d",
        "explanation": "The correct downstream sequence of landforms developed under fluvial processes is: Gorge (upper course, high erosion) -> Piedmont plain/Alluvial fan (where river leaves mountains) -> Flood plain (middle/lower course, deposition and meandering) -> Delta (final deposition at the mouth)."
    },
    "q1405-1bvv": {
        "answer": "a",
        "explanation": "The description matches that of granite. It is a (i) coarse-grained igneous rock with quartz, feldspar, and mica. It is felsic, meaning it has a (ii) high proportion of silica. This composition results in a (iii) lower specific gravity than mafic rocks, and it typically has a (iv) light grey to pinkish color."
    },
    "q2636-1bvv": {
        "answer": "a",
        "explanation": "An outwash plain, or sandur, is a plain formed of glacio-fluvial deposits laid down by meltwater streams at the terminus (front) of a glacier. Peneplains, flood plains, and pan plains are formed by non-glacial fluvial processes."
    },
    "q2246-1bvv": {
        "answer": "a",
        "explanation": "An insequent stream is one that develops on a surface of uniform resistance and whose course shows no apparent control by the initial slope, rock type, or geologic structure. Its drainage pattern is often dendritic."
    },
    "q2634-1bvv": {
        "answer": "d",
        "explanation": "Matching fault types with their descriptions: (A) A lateral (strike-slip) fault involves (II) horizontal displacement. (B) A normal fault involves (I) displacement in opposite directions (extension). (C) A reverse fault involves (IV) movement towards each other (compression). (D) A stage (step) fault is one of a series with slopes in the (III) same direction."
    },
    "q1399-1bvv": {
        "answer": "a",
        "explanation": "The Palk Strait is the strait that lies between the Tamil Nadu state of India and the Jaffna District of the Northern Province of Sri Lanka. It connects the Bay of Bengal in the northeast with Palk Bay in the southwest."
    },
    "q930-1bvv": {
        "answer": "c",
        "explanation": "The primary lines of evidence Alfred Wegener used to support his theory of continental drift were (1) the 'jigsaw puzzle' fit of the continents, especially South America and Africa, and (3) the presence of identical fossils of land-based plants and animals on continents now separated by vast oceans."
    },
    "q4023-1bvv": {
        "answer": "b",
        "explanation": "While there were many objections to Wegener's Continental Drift theory, the most significant scientific reason for its initial rejection was his proposed mechanism. The forces he cited ('pole-fleeing' force and tidal forces) were demonstrably far too weak to move entire continents, so his theory lacked a plausible driving force."
    },
    "q4070-1bvv": {
        "answer": "d",
        "explanation": "Rivers, sea waves, and wind can all carry fine particles of sediment in suspension within the fluid. A glacier, however, transports material frozen within the ice or dragged along its base. It does not carry a load in suspension in the same way a fluid does."
    },
    "q4120-1bvv": {
        "answer": "a",
        "explanation": "Mass wasting is the general term for the downslope movement of rock, regolith (soil and loose debris), and soil under the direct influence of gravity. It does not require a transporting medium like water, wind, or ice."
    },
    "q7019-1bvv": {
        "answer": "c",
        "explanation": "The correct sequence of major seafloor features moving from a continent out into the deep ocean is: Continental shelf (shallow, submerged extension of the continent) -> Continental slope (steep drop-off) -> Sea plain (or Abyssal plain, the deep, flat ocean floor) -> Ocean deeps (trenches)."
    },
    "q2733-1bvv": {
        "answer": "d",
        "explanation": "Matching the topography with its characteristic landform: (A) Aeolian (wind) topography features (I) Yardangs. (B) Glacial topography features (IV) Arêtes. (C) Fluvial (river) topography features (III) Alluvial fans. (D) Marine (coastal) topography features (II) Tombolos."
    },
    "q7471-1bvv": {
        "answer": "a",
        "explanation": "This statement accurately defines the difference. A mineral is a naturally occurring, inorganic solid with a definite chemical composition and an ordered internal structure (crystal lattice). A rock is a solid aggregate of one or more minerals."
    },
    "q1879-1bvv": {
        "answer": "c",
        "explanation": "Matching depositional places with their names: (A) The coarsest material found in the (II) Lag deposits remains in the channel. (B) Fine sediments deposited on the (III) Vertical accretion deposits form the overbank flood plain. (C) Point bars are (IV) Lateral accretion deposits at the channel margin. (D) Material at the valley margin is (I) Colluvium."
    },
    "q9231-1bvv": {
        "answer": "c",
        "explanation": "As a wave approaches the coast and enters shallow water, its form changes. The wave slows down, its height increases, and the crests become more closely spaced. Eventually, the wave becomes too steep and unstable, and it topples over, which is the process of a wave breaking. This is followed by the swash and backwash on the beach."
    },
    "q2174-1bvv": {
        "answer": "c",
        "explanation": "Plucking (or quarrying) is a process of glacial erosion where meltwater freezes in the cracks and joints of bedrock at the base of the glacier. As the glacier moves, it pulls or 'plucks' loose blocks of rock away. This process is unique to glacial erosion."
    },
    "q8230-1bvv": {
        "answer": "c",
        "explanation": "Soil creep is the very slow, gradual, and persistent downslope movement of soil and regolith. It is an imperceptibly slow form of mass wasting, often recognized by its effects like tilted trees and fence posts."
    },
    "q5384-1bvv": {
        "answer": "c",
        "explanation": "Continental shelves are typically narrow along active continental margins, where there is a convergent plate boundary. The western coast of South America is an active margin where the Nazca plate is subducting beneath the South American plate, resulting in a narrow shelf and a deep offshore trench."
    },
    "q2463-1bvv": {
        "answer": "b",
        "explanation": "The Vindhyan System is a vast sequence of Proterozoic sedimentary rocks in central India. It is largely unfossiliferous but is economically important as a major source of building materials, including high-quality sandstone (e.g., for Red Fort) and limestone for cement, as well as being the source of Panna diamonds."
    },
    "q2481-1bvv": {
        "answer": "c",
        "explanation": "Uniformitarianism is the fundamental geologic principle that the same natural laws and processes that operate in the universe now have always operated in the past and apply everywhere. It is often summarized as 'the present is the key to the past'."
    },
    "q4489-1bvv": {
        "answer": "a",
        "explanation": "Palaeomagnetism, ocean floor spreading, and Wegener's original idea of tidal forces are all concepts related to continental drift and plate tectonics. The 'Thermal Contraction' theory was an older, competing hypothesis for mountain building, which proposed that the Earth's features formed as the planet cooled and shrank. It does not support continental drift."
    },
    "q5446-1bvv": {
        "answer": "a",
        "explanation": "A constructive plate margin is another term for a divergent boundary, where tectonic plates are moving apart and new lithosphere is being created. The Mid-Atlantic Ridge is a classic example of a divergent boundary where new oceanic crust is being formed."
    },
    "q1401-1bvv": {
        "answer": "c",
        "explanation": "Igneous rocks are classified based on their silica ($SiO_2$) content. Rocks with over 65% silica are termed 'silicic' or 'felsic' (or acidic). Mafic rocks are silica-poor, and intermediate rocks fall in between."
    },
    "q7037-1bvv": {
        "answer": "d",
        "explanation": "A 'Ria Coast' is a coastline characterized by rias, which are drowned river valleys. This landform is created when sea level rises and floods unglaciated river valleys, and is therefore a type of submerged upland shoreline."
    },
    "q1410-1bvv": {
        "answer": "a",
        "explanation": "The silica content of these igneous rocks decreases in the following order: (ii) Granite (felsic, >65% $SiO_2$) -> (iii) Andesite (intermediate, ~55-65% $SiO_2$) -> (i) Basalt (mafic, ~45-55% $SiO_2$) -> (iv) Peridotite (ultramafic, <45% $SiO_2$)."
    },
    "q4900-1bvv": {
        "answer": "c",
        "explanation": "In a dendritic drainage system that develops on tilted rock beds, a master consequent stream flows down the main slope. Obsequent streams are tributaries that flow in the direction opposite to that of the master consequent stream."
    },
    "q7000-1bvv": {
        "answer": "d",
        "explanation": "The form factor ($F_f$) is a dimensionless ratio used in quantitative geomorphology to describe the shape of a drainage basin. It is calculated as the basin area (A) divided by the square of the maximum basin length (L): $F_f = A / L^2$."
    },
    "q2728-1bvv": {
        "answer": "d",
        "explanation": "In structural geology, the 'strike' of a tilted rock layer is the direction of the line formed by the intersection of that layer's surface with a horizontal plane. It is perpendicular to the 'dip' direction."
    },
    "q5573-1bvv": {
        "answer": "b",
        "explanation": "The theory that submarine canyons were eroded by dense, sediment-laden turbidity currents flowing down the continental slope was most famously championed by the American geologist Reginald Aldworth Daly in the 1930s."
    },
    "q2630-1bvv": {
        "answer": "c",
        "explanation": "The concept of 'base level'—the lowest level to which a river can erode its channel—was introduced by the American geologist and explorer John Wesley Powell in 1875. W.M. Davis later incorporated it as a critical element in his cycle of erosion theory."
    },
    "q1436-1bvv": {
        "answer": "d",
        "explanation": "Matching the rock/mineral to its type: (A) Bauxite is the primary ore of aluminum, a (II) nonferrous mineral. (B) Granite is an (IV) igneous rock. (C) Slate is a (I) metamorphic rock. (D) Lignite is a form of coal, which is a (III) sedimentary rock."
    },
    "q4117-1bvv": {
        "answer": "c",
        "explanation": "The rate and process of erosion are controlled by factors such as climate (e.g., rainfall), the nature of the material being eroded (e.g., rock hardness), and the slope of the land. The absolute geographic location of the material does not, in itself, control the erosion process, although it determines which other factors are at play."
    },
    "q3880-1bvv": {
        "answer": "b",
        "explanation": "Frost action, or frost shattering, is a process of mechanical weathering where water freezes in rock cracks, expands, and breaks the rock apart. This process is highly effective at creating angular rock fragments that accumulate at the base of cliffs as scree or talus slopes."
    },
    "q7467-1bvv": {
        "answer": "a",
        "explanation": "Statement 1 is incorrect because mass movement is driven solely by gravity, not by a geomorphic agent like running water (which would be erosion). Statement 2 is correct; weathering weakens the rock and produces the loose debris (regolith) that can then be moved downslope by gravity."
    },
    "q1454-1bvv": {
        "answer": "c",
        "explanation": "The generalized structure of the continental crust is often simplified into three layers from top to bottom: (i) a thin layer of sedimentary rocks, overlying (ii) a granitic (or felsic) upper crustal layer, which in turn overlies (iii) a basaltic (or mafic) lower crustal layer."
    },
    "q2870-1bvv": {
        "answer": "d",
        "explanation": "The San Andreas Fault is a classic example of a transform plate boundary, where the Pacific Plate and the North American Plate slide past each other. The motion is right-lateral, or dextral; from either side of the fault, the opposite side appears to be moving to the right."
    },
    "q9653-1bvv": {
        "answer": "a",
        "explanation": "Matching authors to their works or concepts in geomorphology: (A) Charles Lyell wrote the influential book 'Principles of Geology'. (B) Stephen Trudgill is a prominent researcher in (IV) Limestone geomorphology. (C) John Pethick is a key author on (I) Coastal geomorphology. (D) C.H. Crickmay is known for his work on (II) 'The Work of the River' and the concept of panplanation."
    },
    "q7438-1bvv": {
        "answer": "b",
        "explanation": "Statement 1 is correct; V-shaped valleys and waterfalls are typical of the energetic youth stage of a river. Statement 2 is incorrect; in the mature stage, the river has a gentler gradient but has not yet reduced the entire landscape to sea level. Statement 3 is correct; in the old stage, the river has a very low gradient, and features like waterfalls and rapids have been eroded away."
    },
    "q1413-1bvv": {
        "answer": "c",
        "explanation": "Clastic sedimentary rocks are classified by grain size. Rudaceous rocks are coarse-grained (gravel). Arenaceous rocks are sandy. Argillaceous rocks are fine-grained, composed of silt and clay. Since siltstone is made of silt-sized particles, it belongs to the argillaceous group."
    },
    "q1403-1bvv": {
        "answer": "a",
        "explanation": "Gneiss is a high-grade, foliated metamorphic rock. It is characterized by alternating bands of light-colored minerals (like feldspar and quartz) and dark-colored minerals (like biotite and hornblende). It typically forms from the metamorphism of granite or sedimentary rocks."
    },
    "q932-1bvv": {
        "answer": "c",
        "explanation": "Matching agents with their erosional features: (A) Moving ice creates (III) Hanging valleys. (B) Dashing waves create (IV) Head and Bay coastlines. (C) Blowing wind can create depositional features like (I) Barchans (though it also erodes). (D) Running water can create (II) Incised meanders."
    },
    "q9718-1bvv": {
        "answer": "b",
        "explanation": "Of the types of mass movements listed, a debris avalanche is the most rapid. It is a very fast-moving, turbulent flow of rock, debris, and often water and air, capable of reaching extremely high velocities on steep slopes."
    },
    "q5575-1bvv": {
        "answer": "d",
        "explanation": "Corrosion is the process of erosion where certain types of rock are chemically dissolved by the water flowing over them. This is particularly effective on soluble rocks like limestone. Corrasion, or abrasion, is the physical grinding action of sediment carried by the water."
    },
    "q7044-1bvv": {
        "answer": "b",
        "explanation": "In the context of erosion, corrosion refers to the chemical process where water dissolves minerals from the rock, removing material in solution. This is distinct from corrasion (abrasion), which is the physical grinding and scraping by sediment carried in the water."
    },
    "q1452-1bvv": {
        "answer": "b",
        "explanation": "Natural levees are ridges of sediment (typically silt and sand) that are built up along the banks of a river. They are formed during floods when the river overflows its channel and deposits its coarsest sediment immediately adjacent to the banks."
    },
    "q9923-1bvv": {
        "answer": "a",
        "explanation": "While Alfred Wegener proposed the original theory of continental drift, it was the South African geologist Alexander du Toit who was one of its strongest supporters. He gathered extensive evidence from the southern continents and published it in his 1937 book, 'Our Wandering Continents'."
    },
    "q2589-1bvv": {
        "answer": "c",
        "explanation": "Badland topography is a type of dry terrain characterized by extensive erosion of soft sedimentary rocks and clay-rich soils into a landscape of steep slopes, gullies, and ravines. It is formed by the combined action of intermittent, intense rainfall (water) and wind."
    },
    "q7066-1bvv": {
        "answer": "d",
        "explanation": "The 'Hydraulic Slope Theory' is not a widely known classical theory. However, Robert E. Horton was a pioneering American hydrologist who did extensive work on the physics of runoff, infiltration, and drainage basin morphology, making him the most likely originator of a concept with this name among the options."
    },
    "q1425-1bvv": {
        "answer": "a",
        "explanation": "Basic (or mafic) igneous rocks are characterized by low silica content and high concentrations of iron and magnesium. Gabbro is the coarse-grained, intrusive equivalent of basalt and is a classic example of a basic rock. The other options are metamorphic or intermediate igneous rocks."
    },
    "q1641-1bvv": {
        "answer": "d",
        "explanation": "This matches parent rocks to their metamorphic forms: (A) Granite metamorphoses into (II) Gneiss. (B) Shale metamorphoses into (I) Slate at low grade. (C) Sandstone metamorphoses into (IV) Quartzite. (D) Basalt metamorphoses into (III) Schist (specifically greenschist or blueschist)."
    },
    "q5146-1bvv": {
        "answer": "c",
        "explanation": "Deflation is the process of wind erosion that removes loose, fine-grained particles from a surface. Over time, in a particular area, this can scour out depressions of various sizes. These features are known as deflation hollows or blowouts."
    },
    "q8675-1bvv": {
        "answer": "a",
        "explanation": "Transverse dunes are long, linear to sinuous sand ridges that are oriented perpendicular (at right angles) to the prevailing wind direction. They form in areas with an abundant supply of sand."
    },
    "q9060-1bvv": {
        "answer": [
            "b",
            "c",
            "d"
        ],
        "explanation": "(b) The Narmada is a classic example of a river flowing through a rift valley. (c) The Sutlej is an antecedent river, having cut through the uplifting Himalayas. (d) The Ghaggar is an endorheic (internal drainage) river that flows into the Thar Desert. (a) The Kosi is known for being an antecedent river, not a simple consequent one."
    },
    "q9172-1bvv": {
        "answer": "c",
        "explanation": "Geomorphic landforms are often classified into orders of magnitude. First-order forms are the continents and ocean basins. Second-order forms are major features on them, like mountain ranges, plains, and plateaus. Cirques are individual landforms within a mountain range, typically considered third-order features."
    },
    "q4119-1bvv": {
        "answer": "c",
        "explanation": "This question asks for the mismatched pair. Stacks are coastal features, oxbow lakes are fluvial, and evaporites are found in arid landscapes. However, Ergs (sand seas) are features of arid or aeolian landscapes, not glacial landscapes. Therefore, (c) is the mismatch."
    },
    "q1412-1bvv": {
        "answer": "d",
        "explanation": "Statements a, b, and c are correct characteristics of sedimentary rocks. Statement (d) is incorrect; while bedding planes can be tilted by later tectonic activity, they are originally deposited horizontally or nearly horizontally according to the principle of original horizontality."
    },
    "q5484-1bvv": {
        "answer": "d",
        "explanation": "A slab avalanche occurs when a cohesive layer of snow breaks away from the underlying snowpack and slides downslope as a single block. Because they involve a large mass of snow moving at once and can reach very high speeds, slab avalanches are generally the most dangerous and destructive type."
    },
    "q3622-1bvv": {
        "answer": "d",
        "explanation": "A cuspate delta is a pointed, tooth-shaped delta formed by the action of a single, dominant river channel and shaped by regular, opposing wave action. The delta of the Tiber River in Italy is a classic example of a cuspate delta."
    },
    "q2680-1bvv": {
        "answer": "a",
        "explanation": "A fluvio-glacial deposit is one formed by glacial meltwater. A kame terrace is a bench-like deposit of sand and gravel laid down by a meltwater stream flowing between a valley glacier and the valley side. The other options are not glacial in origin."
    },
    "q2172-1bvv": {
        "answer": "a",
        "explanation": "Paternoster lakes are a chain of small, circular lakes that occupy rock basins in a glacial trough, connected by a single stream. The appearance resembles beads on a rosary, hence the name."
    },
    "q5131-1bvv": {
        "answer": "a",
        "explanation": "The supercontinent Pangaea began to break apart in the Early-Middle Jurassic Period, with the initial rifting between Laurasia and Gondwana occurring approximately 175-180 million years ago."
    },
    "q1492-1bvv": {
        "answer": "b",
        "explanation": "The correct geographic sequence of these landforms from South to North is: (i) Indo-Gangetic Plain -> (v) Himalayas -> (ii) Plateau of Tibet -> (iv) Altyn Tagh (a mountain range on the northern edge of the Tibetan Plateau) -> (iii) Tarim Basin."
    },
    "q1400-1bvv": {
        "answer": "a",
        "explanation": "In geology, the term 'rock' is used broadly to refer to any naturally occurring solid mass or aggregate of minerals or mineraloid matter. This includes all the materials that make up the Earth's crust, from hard granite to soft clay."
    },
    "q1491-1bvv": {
        "answer": "a",
        "explanation": "The Chad Basin in North-Central Africa is a large endorheic basin, meaning it has internal drainage. Rivers within the basin, such as the Chari River, flow into Lake Chad, and there is no outlet to the sea. Water is lost only through evaporation and seepage."
    },
    "q9148-1bvv": {
        "answer": "c",
        "explanation": "The San Andreas Fault in California is the most famous example of a transform fault. It forms a transform plate boundary where the Pacific Plate and the North American Plate slide horizontally past one another in a right-lateral (dextral) motion."
    },
    "q5138-1bvv": {
        "answer": "b",
        "explanation": "Hotspots are thought to be stationary or slow-moving plumes of hot material rising from the mantle. As a tectonic plate moves over the fixed hotspot, a chain of volcanoes is created. The volcano directly over the hotspot is active, but as the plate carries it away from the magma source, it becomes dormant and eventually extinct."
    },
    "q3504-1bvv": {
        "answer": "c",
        "explanation": "Plate tectonics is the theory describing the movement of Earth's lithospheric plates. Subduction, mountain building, and sea-floor spreading are all direct results of these plate interactions. The movement of ocean currents is driven by factors like wind, temperature, and salinity differences, not directly by plate tectonics (though plate tectonics shapes the ocean basins)."
    },
    "q3893-1bvv": {
        "answer": "d",
        "explanation": "Static rejuvenation occurs due to changes within the river system itself, without a change in the ultimate base level. This can be caused by (1) a decrease in the river's sediment load (making it more erosive) or (2) an increase in the volume of river discharge (increasing its energy). Lowering of the outlet and changes in sea level are forms of dynamic rejuvenation."
    },
    "q1435-1bvv": {
        "answer": "b",
        "explanation": "Matching the rock to its type: (A) Sandstone is a (II) Sedimentary rock. (B) Pumice is an (IV) Extrusive igneous rock. (C) Batholiths are large bodies of (I) Intrusive igneous rock. (D) Quartzite is a (III) Metamorphic rock."
    },
    "q1430-1bvv": {
        "answer": "a",
        "explanation": "The assertion is correct; basalt is a volcanic (extrusive) rock that cools on the surface, while granite is a plutonic (intrusive) rock that cools below the surface and is exposed by erosion. The reason correctly identifies their rock types and provides a perfect explanation for the assertion."
    },
    "q5479-1bvv": {
        "answer": "a",
        "explanation": "A conservative plate margin, also known as a transform boundary, is where two tectonic plates slide horizontally past each other without creating or destroying lithosphere. The San Andreas Fault is the classic example of a conservative margin."
    },
    "q9760-1bvv": {
        "answer": "a",
        "explanation": "(B) Rusting is oxidation, a chemical process. (C) The alteration of feldspar to clay is hydrolysis, a chemical process. (D) The dissolution of minerals by acid is a chemical process. (A) Movement along a fracture is a physical process. Therefore, B, C, and D are examples of chemical weathering."
    },
    "q1402-1bvv": {
        "answer": "b",
        "explanation": "The process of lithification, which turns sediment into rock, involves compaction and cementation. These processes significantly change the sediment's porosity, density, and texture. However, the overall mineralogical composition of the original sediment grains is the characteristic that is least likely to change substantially."
    },
    "q1404-1bvv": {
        "answer": "c",
        "explanation": "An intrusive (or plutonic) igneous rock is one that forms from magma that cools and solidifies slowly beneath the Earth's surface. This slow cooling allows for the growth of large, visible mineral crystals."
    },
    "q3231-1bvv": {
        "answer": "c",
        "explanation": "The Himalayan mountain range was formed, and continues to be uplifted, by the collision between two continental plates: the Indian Plate and the Eurasian Plate. This continent-continent collision causes intense folding, faulting, and crustal thickening."
    },
    "q1876-1bvv": {
        "answer": "c",
        "explanation": "Assertion (A) is false; eskers are not formed by wind. Reason (R) is true; eskers are sinuous ridges of sand and gravel deposited by meltwater streams flowing beneath, within, or on top of glaciers. They are a type of fluvio-glacial depositional feature."
    },
    "q1429-1bvv": {
        "answer": "d",
        "explanation": "Clay is composed of very fine-grained particles. The aggregate of these particles contains a large volume of tiny interstitial spaces, or pores. Therefore, clay has high porosity, even though its permeability (ability to transmit water) is very low due to the poor connection between these pores."
    },
    "q3882-1bvv": {
        "answer": "a",
        "explanation": "Glacio-fluvial landforms are those deposited by glacial meltwater. Kames, valley trains (outwash confined to a valley), and eskers are all classic examples of glacio-fluvial deposits. Scree is a slope deposit formed by frost action, a periglacial process."
    },
    "q1393-1bvv": {
        "answer": "b",
        "explanation": "The world's major hot deserts (subtropical deserts) are typically located between 20° and 30° latitude in both hemispheres, concentrated on the western sides of continents. This location is due to the influence of subtropical high-pressure cells and cold offshore ocean currents."
    },
    "q2974-1bvv": {
        "answer": "c",
        "explanation": "This option contains only landforms created primarily by wind erosion. Demoiselles (earth pillars) and mushroom rocks are formed by differential abrasion. Yardangs are streamlined ridges carved by wind. The other options include depositional (Barchan, Loess) or solutional (Lapies) features."
    },
    "q4511-1bvv": {
        "answer": "b",
        "explanation": "Kames, drumlins, and moraines are all depositional landforms created by glaciers and their meltwater. A roche moutonnée is an erosional landform, a rock knob that has been smoothed and streamlined by glacial abrasion on one side and steepened by glacial plucking on the other."
    },
    "q8663-1bvv": {
        "answer": "a",
        "explanation": "This group includes only landforms produced by erosion. Playas are depositional, but Pinnacles (erosional remnants) and Potholes (fluvial erosion) are erosional. The other options contain depositional features like Drip stones, Drumlin, Wave built Platform, Kame, and Levees."
    },
    "q1415-1bvv": {
        "answer": "c",
        "explanation": "Conglomerate and breccia are both clastic sedimentary rocks composed of gravel-sized particles (>2 mm). The key difference between them is the shape of the clasts: conglomerates are composed of rounded pebbles and cobbles, while breccias are composed of angular fragments."
    },
    "q2307-1bvv": {
        "answer": "c",
        "explanation": "The Glossopteris flora is a group of fossil plants characteristic of the Permian period on the supercontinent of Gondwana. Its fossils are found in India, South Africa, Australia, South America, and Antarctica, and were key evidence for continental drift. Norway was part of the northern continent, Laurasia, and is devoid of this flora."
    },
    "q8173-1bvv": {
        "answer": "b",
        "explanation": "The concept of sea floor spreading is supported by evidence from the oceans, including volcanic activity at ridges, the age of rocks increasing away from ridges, and the pattern of magnetic stripes on the ocean floor. The distribution of fossils on different continents was evidence for Wegener's earlier theory of Continental Drift, not directly for sea floor spreading."
    },
    "q8159-1bvv": {
        "answer": "a",
        "explanation": "According to Wegener's theory, the distinctive 'S' shape of the Atlantic Ocean is a direct result of the east-west drift of the North and South American continents away from Eurasia and Africa. The differential movement and rotation of these continents created the curved shape of the ocean basin."
    },
    "q8177-1bvv": {
        "answer": "d",
        "explanation": "All three statements are correct principles of plate tectonics. (1) Plates can be composed of continental crust, oceanic crust, or both. (2) and (3) Plates are not permanent features; they are in constant motion, and their size and shape change over geological time as new crust is formed at divergent boundaries and old crust is consumed at convergent boundaries."
    },
    "q9810-1bvv": {
        "answer": "b",
        "explanation": "The passage explicitly states: 'Hydrological processes can exert a significant and dynamic influence on slope stability, as both a landslide preparatory factors... and as a landslide trigger factor...'. This identifies hydrology as the key dynamic influence."
    },
    "q8154-1bvv": {
        "answer": "d",
        "explanation": "The passage explicitly lists earthquakes as a potential trigger for landslides ('the landslide is activated by a specific event (for example, a heavy precipitation, an earthquake...)'). Therefore, the statement that landslides cannot occur due to earthquakes is incorrect."
    },
    "q8164-1bvv": {
        "answer": "b",
        "explanation": "F.B. Taylor's early hypothesis, which predated Wegener's, proposed that the continents were once grouped into two landmasses: Laurasia in the north and Gondwanaland in the south. These are the same names later used in the context of Pangaea's breakup."
    },
    "q8174-1bvv": {
        "answer": "d",
        "explanation": "The Mid-Atlantic Ridge is the divergent plate boundary separating several plates. In the North Atlantic, it separates the Eurasian and North American plates. In the South Atlantic, it separates the African and South American plates. Therefore, all these pairs are diverging apart at different sections of the ridge."
    },
    "q8175-1bvv": {
        "answer": "a",
        "explanation": "The assertion is true; over geological time, a subducted plate is completely assimilated into the mantle. The reason is also true; mantle convection is the driving force for plate tectonics. However, the reason is a general statement about the driving force and does not directly explain the specific process of plate consumption. Therefore, both are true but the reason is not the correct explanation of the assertion."
    },
    "q8176-1bvv": {
        "answer": "b",
        "explanation": "Assertion (A) is true; convergent plate margins, especially subduction zones, are sites of the most intense and numerous earthquakes. Reason (R) is also true; the Benioff (or Wadati-Benioff) zone is the dipping plane of earthquake foci within a subducting slab. However, the reason merely defines the zone rather than explaining the concentration of energy. The concentration of energy is due to the immense stress from plate collision, which the Benioff zone delineates but doesn't cause."
    },
    "q8166-1bvv": {
        "answer": "b",
        "explanation": "In Wegener's model, the supercontinent Pangaea was surrounded by a single global ocean called Panthalassa. As the continents drifted apart to their present positions, the Pacific Ocean is the major remnant of this ancient superocean."
    },
    "q8167-1bvv": {
        "answer": "a",
        "explanation": "The assertion and reason describe an early geological concept. It was proposed that the continental crust, made of lighter 'SiAl' (Silicon and Aluminum), floated on the denser oceanic crust, 'SiMa' (Silicon and Magnesium). This density difference was used to explain the elevation of continents and was a key part of Wegener's ideas, making the reason a direct explanation for the assertion."
    },
    "q8168-1bvv": {
        "answer": "a",
        "explanation": "The assertion is true; according to the theory, Pangaea broke into two major parts (Laurasia and Gondwanaland). The reason is also true; Pangaea was a supercontinent surrounded by the superocean Panthalassa. However, the fact that it was surrounded by an ocean doesn't explain *why* it broke apart. Therefore, both are true, but the reason is not the correct explanation of the assertion."
    },
    "q9808-1bvv": {
        "answer": "b",
        "explanation": "The passage defines the hazard footprint as the factors that determine 'the rate, travel distance and volume of Debris'. This directly corresponds to option B."
    },
    "q9811-1bvv": {
        "answer": "c",
        "explanation": "The passage explicitly lists 'Landslide triggering factors' as including 'rainfall, earthquake, volcanic activity, changes in groundwater, erosion or undercutting and human activities'. Option C contains elements from this list."
    },
    "q9812-1bvv": {
        "answer": "c",
        "explanation": "The first sentence of the passage defines risk: 'Risk is a product of two components the hazard, which can be defined as the probability of occurrence of a specific event within a given time period; and the consequence, typically measured by the cost of damage or loss of life.' This definition directly matches option C."
    },
    "q8169-1bvv": {
        "answer": "d",
        "explanation": "The passage states: 'When a constructive boundary happens underneath oceanic lithosphere, the rising convection current and flow beneath the lithosphere allow the formation of mid-ocean ridge.' This identifies mid-oceanic ridges as the example of a divergent plate boundary."
    },
    "q8171-1bvv": {
        "answer": "b",
        "explanation": "The passage states that Plate Tectonics theory helps to explain 'the origin and place of Earthquakes, mountain-building, volcanic activity, and oceanic trench'. It does not mention ocean currents, which are driven by other factors like wind and water density."
    },
    "q8172-1bvv": {
        "answer": "c",
        "explanation": "The passage states: 'Divergent boundaries otherwise called ‘constructive plate margins’ because that new crust is formed at the mid oceanic ridges.' The eruption of lava from the mantle is the process that forms this new crust."
    },
    "q8160-1bvv": {
        "answer": "b",
        "explanation": "The passage highlights the 'jigsaw puzzle' fit of continents as a key piece of evidence Wegener used: 'The east bank of South America and the west bank of Africa appear to fit together like slices of a jigsaw puzzle...'. This is a central and certain aspect of his argument."
    },
    "q8161-1bvv": {
        "answer": "d",
        "explanation": "The passage lists the jigsaw fit, fossil distribution ('Comparable plant and creature fossils'), and glacial deposits ('Permo-Carboniferous glacial residue') as evidence for the theory. The presence of the Atlantic Ocean is the result of the drift, not the evidence for it."
    },
    "q8163-1bvv": {
        "answer": "b",
        "explanation": "The passage describes Wegener's concept of 'Flight from the pole' ('Pohlflucht' in German) as a force that 'would cause the continents to float towards the equator.' This implies a drifting of continents away from the poles."
    },
    "q8155-1bvv": {
        "answer": "d",
        "explanation": "These terms refer to types of flows, which are classified by the size of the material they carry. Debris flows carry coarse material (up to boulder size). Earth flows involve finer material (sand, silt, clay). Mudflows consist of the finest material, with a high water content. The correct order from larger to smaller particles is Debris flow -> Earth flow -> Mud flow."
    },
    "q8156-1bvv": {
        "answer": "d",
        "explanation": "The passage defines landslides as including 'rapid perceptible movement of dry mass of debris or bed rock'. The other options describe other specific types of mass wasting like soil creep or saturated flows."
    },
    "q8158-1bvv": {
        "answer": "c",
        "explanation": "The passage states: 'Landfall has commonly most noteworthy velocity of movement, among others.' 'Falls' (rockfalls, debris falls) are mass movements where material detaches from a steep slope and descends through the air, giving them the highest potential velocity."
    }
}