{
  "q146-0": {
    "answer": "d",
    "explanation": "Knickpoints are abrupt changes in the longitudinal profile of a stream, representing a sharp steepening of the stream gradient. They are typically formed by river rejuvenation due to factors like tectonic uplift or a fall in base level."
  },
  "q121-0": {
    "answer": "b",
    "explanation": "Slickensides are striations on a fault surface that indicate the direction of relative movement. Horizontal slickensides mean the movement was parallel to the strike of the fault, which is the definition of a strike-slip fault."
  },
  "q2-0": {
    "answer": "c",
    "explanation": "For a dipping bed on a flat, horizontal surface, the true thickness (T) is calculated using the formula T = W × sin(θ), where W is the outcrop width and θ is the dip angle. Given W = 20 m and θ = 30°, the calculation is T = 20 × sin(30°) = 20 × 0.5 = 10 m."
  },
  "q20-0": {
    "answer": "b",
    "explanation": "To find the mean direction from a set of azimuths (palaeocurrent directions), the vector mean should be calculated. The given directions (N350°, N17°, N355°, N15°, etc.) are clustered around North. A vector summation of these directions yields a resultant vector pointing almost due North, corresponding to N360° or N0°."
  },
  "q18-0": {
    "answer": "a",
    "explanation": "Analyzing the statements: (I) Transposition indicates intense strain but not necessarily superposed folding. (II) Transposition largely destroys original stratigraphic information. (III) By definition, transposition foliation develops parallel to the axial planes of tight to isoclinal folds. (IV) Fold closures in transposed domains are typically dismembered and difficult to identify, not 'well identified'. Therefore, only statement III is unequivocally correct."
  },
  "q120-0": {
    "answer": "d",
    "explanation": "The dip angle (θ) can be calculated from the relationship tan(θ) = Contour Interval (CI) / Horizontal Equivalent (HE). Given that CI = 100 m and HE = 100 m, tan(θ) = 100 / 100 = 1. The angle whose tangent is 1 is 45°."
  },
  "q68-0": {
    "answer": "a",
    "explanation": "In a subduction zone, the descending slab heats up and releases water from hydrated minerals. This water lowers the melting point of the overlying mantle wedge (flux melting), inducing the generation of magma that feeds volcanic arcs. This statement accurately describes a fundamental process of subduction zones."
  },
  "q37-0": {
    "answer": "b",
    "explanation": "Rake is the angle measured on the fault plane between the strike line and the net slip vector. A rake of 90° signifies that the slip occurred directly down (or up) the dip of the fault plane, which defines a dip-slip fault (i.e., a normal or reverse fault)."
  },
  "q193-0": {
    "answer": "b",
    "explanation": "A lineation lies on a plane if its plunge and trend are consistent with the plane's orientation. A lineation that trends in the same direction as the plane's dip will have a plunge equal to the plane's dip. The plane (strike 210°, dip 40° NW) has a dip direction of 300°. The lineation in option (b) has a trend of 300° and a plunge of 40°, so it lies on the plane."
  },
  "q259-0": {
    "answer": [
      "a",
      "b",
      "d"
    ],
    "explanation": "Slope stabilization methods are engineering techniques used to prevent landslides. Bolting (installing steel rods), application of shotcrete (sprayed concrete), and use of geogrids (reinforcing fabric) are all common stabilization methods. An impression packer is a tool used for geotechnical investigation, not stabilization."
  },
  "q206-0": {
    "answer": [
      "a",
      "b",
      "d"
    ],
    "explanation": "A duplex is a tectonic structure in a fold-thrust belt composed of a series of stacked, thrust-bounded rock bodies known as 'horses'. The entire system is bounded by a 'floor thrust' (or sole thrust) at its base and a 'roof thrust' at its top."
  },
  "q227-0": {
    "answer": [
      "a",
      "c",
      "d"
    ],
    "explanation": "The M-plane is a reference plane perpendicular to the fault plane and containing the slickenline (slip vector). (a) The pole to the M-plane is perpendicular to the M-plane and thus perpendicular to the slickenline. (c, d) Because the M-plane is perpendicular to the fault plane, its pole must lie on the fault plane and be perpendicular to the fault plane's pole."
  },
  "q279-0": {
    "answer": "5.6",
    "explanation": "In Anderson's theory for normal faulting, the maximum principal stress (σ₁) is vertical and equal to the lithostatic pressure (ρgz). Given σ₁ = 150 MPa, ρ = 2700 kg/m³, and g = 10 m/s², the depth (z) is calculated as z = σ₁ / (ρg) = (150 × 10⁶ Pa) / (2700 kg/m³ × 10 m/s²) = 5555.6 m, which is 5.6 km when rounded to one decimal place."
  },
  "q252-0": {
    "answer": "a",
    "explanation": "In asymmetrical ripples formed by a unidirectional current, the steeper lee side faces downstream. The dip direction of the cross-bedding on the lee side directly records the direction of the current flow. Therefore, a dip direction of N10°W indicates a flow direction towards N10°W."
  },
  "q291-0": {
    "answer": "c",
    "explanation": "True dip is the angle of a plane measured in a vertical section perpendicular to its strike. An apparent dip is the angle measured in any vertical section not perpendicular to strike. Since the quarry wall (E-W) is not perpendicular to the strike of the dikes (NE-striking), the observed angle is an apparent dip."
  },
  "q284-0": {
    "answer": "d",
    "explanation": "A chevron fold is characterized by straight limbs and sharp, angular hinges, giving it a zigzag or V-shaped profile. This contrasts with folds that have rounded hinges."
  },
  "q333-0": {
    "answer": "18.4",
    "explanation": "The true displacement (net slip) is the vector sum of its three orthogonal components: strike-slip, heave (horizontal dip component), and throw (vertical dip component). Using the 3D Pythagorean theorem: Net Slip = √(strike-slip² + heave² + throw²) = √(13² + 5² + 12²) = √(169 + 25 + 144) = √338 ≈ 18.4 m."
  },
  "q459-hz3": {
    "answer": "b",
    "explanation": "A diapiric fold (diapir) is formed by the upward piercing movement of a mobile and ductile material, such as salt, mud, or magma, through overlying denser rock layers. Gneiss domes are an example associated with magmatic or high-grade metamorphic cores."
  },
  "q485-hz3": {
    "answer": "d",
    "explanation": "Drag folds are minor folds that typically form in a less competent (weaker) rock unit situated between two more competent (stronger) units. They are caused by the shearing force (drag) between the competent layers as they slip past one another during larger-scale folding."
  },
  "q724-hz3": {
    "answer": "c",
    "explanation": "Definitions: (A) Syncline has the youngest rocks in the core (IV). (B) Anticline has the oldest rocks in the core (III). (C) Antiform is a fold that closes upward (I). (D) Synform is a fold that closes downward (II). The correct matching is A-IV, B-III, C-I, D-II."
  },
  "q964-hz3": {
    "answer": "d",
    "explanation": "Net slip is the actual total displacement vector on a fault plane. Separation is the apparent displacement of a feature, measured in a specific direction (e.g., vertical separation is throw). Separation is a projection of the net slip vector, and its magnitude can therefore only be less than or equal to the magnitude of the net slip."
  },
  "q144-hz3": {
    "answer": "d",
    "explanation": "The deep-ocean floor (abyssal plains) is far from terrestrial sediment sources. Sedimentation rates are extremely low, dominated by the slow settling of fine pelagic clays and the microscopic skeletons of marine organisms. Continental shelves, slopes, and rises all receive much higher volumes of terrigenous sediment."
  },
  "q477-hz3": {
    "answer": "b",
    "explanation": "Strike-slip faults are fundamental structures that accommodate horizontal motion in both oceanic and continental crust. In oceanic settings, they manifest as transform faults offsetting mid-ocean ridges. In continental settings, they form major fault systems like the San Andreas Fault."
  },
  "q468-hz3": {
    "answer": "a",
    "explanation": "A monocline is a step-like fold that represents a localized zone of steeper dip within otherwise horizontal or gently dipping strata. It is essentially a localized warp or bend, often caused by faulting at depth."
  },
  "q726-hz3": {
    "answer": "a",
    "explanation": "A hiatus is the stratigraphic term for the interval of geologic time missing at an unconformity, representing the period of non-deposition and/or erosion. Hade, throw, and heave are terms related to the geometry of faults."
  },
  "q644-hz3": {
    "answer": "c",
    "explanation": "According to the Dunham classification for carbonate rocks, a packstone is defined as a grain-supported rock that contains intergranular carbonate mud. A grainstone is also grain-supported but lacks mud, while a wackestone is mud-supported."
  },
  "q1064-hz3": {
    "answer": "d",
    "explanation": "The strain ellipsoid describes rock deformation, with axes X > Y > Z representing maximum extension, intermediate, and maximum shortening, respectively. Foliation (e.g., cleavage, schistosity) is a planar fabric that develops perpendicular to the direction of maximum shortening (the Z-axis). This plane of flattening is the XY plane of the strain ellipsoid."
  },
  "q708-hz3": {
    "answer": "a",
    "explanation": "This refers to the Ramsay classification of folds. Class 1B folds are parallel folds, where layer thickness measured perpendicular to bedding is constant. To maintain this constant thickness, the inner arc must be more sharply curved than the outer arc. A higher curvature corresponds to a smaller radius. Thus, the curvature of the outer arc is less than that of the inner arc."
  }
}
